
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
// Убираем проверку Обязательного заполнения  реквизита  - Количества посещений.
// т.к. если номенклатура не Посещение аттракциона, то количество посещений не нужно
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидНоменклатуры <> Перечисления.ВидНоменклатуры.ПосещениеАттракциона Тогда 
		НомерУдаляемого = ПроверяемыеРеквизиты.Найти("КоличествоПосещений");
		Если НомерУдаляемого <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаляемого);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
