
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура СгенерироватьДанные() Экспорт
	
	ТекстМакета = ПолучитьМакет("СлучайныеФИО").ПолучитьТекст();
	СписокПосетителей = СтрРазделить(ТекстМакета,Символы.ПС);	// Получили массив ФИО из макета
	КоличествоПосетителей = СписокПосетителей.Количество();
	СписокАттракционов = СписокАттракционов();
	
	//Алгоритм  :
	
	// Расчитываем каждый день периода
	// В понедельник парк не работает
	// Определяем сколько посетителей приходит в парк
	// коэффи циент в выходые дни - 1,5 
	// Выбираем случайных посетителей из списка
		
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Курсор = Период.ДатаНачала;
	
	Пока Курсор < Период.ДатаОкончания Цикл
		
		Если ДеньНедели(Курсор)=1 Тогда
			Продолжить;
		КонецЕсли;
		
		КоэффициентПосетителей =1;
		
		Если ДеньНедели(Курсор)>=6 Тогда
			КоэффициентПосетителей = 1.5;
		КонецЕсли;
		
		КоличествоПосетителей = ГСЧ.СлучайноеЧисло(10,30)* КоэффициентПосетителей;
		
		Для НомерПосетителя =1 по КоличествоПосетителей Цикл
			
			ИндексСлучайногоПосетителя = ГСЧ.СлучайноеЧисло(0, 99);
			
			ФИОПосетителя = СписокПосетителей[ИндексСлучайногоПосетителя];
			
			Посетитель = ПолучитьПосетителя(ФИОПОсетителя);
			
			СформироватьПосещенияПосетителя(Посетитель, Курсор, СписокАттракционов, ГСЧ);
			
		КонецЦикла;
		
		Курсор = Курсор +86400; //Увеличиваем на 1 день т.е. прибавляем количество секунд
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокАттракционов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Аттракционы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПосетителя(ФИОПОсетителя)
	
	Резкльтат = Справочники.Клиенты.НайтиПоНаименованию(ФИОПОсетителя,Истина);
	
	Если Не ЗначениеЗаполнено(Резкльтат) Тогда
		СпрОбъект = Справочники.Клиенты.СоздатьЭлемент();
		СпрОбъект.Заполнить(Неопределено);
		СпрОбъект.Наименование = ФИОПОсетителя;
		Если Не СпрОбъект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Ошибка содздания кклиента";
		КонецЕсли;
		СпрОбъект.Записать();
		Результат = СпрОбъект.Ссылка;
	КонецЕсли;
		
	Возврат Результат;		
			
КонецФункции


Процедура СформироватьПосещенияПосетителя(Посетитель, ДатаПосещения, СписокАттракционов, ГСЧ = Неопределено)
	
	// Для каждого посетителя выбираем на сколько аттракционов он пойдет.
	// Проверяем для каждого посещения есть ли билет, если билета нет, покупаем доступный для нужного аттракциона
	// Регистрируем посещение
	
	Если ГСЧ = Неопределено Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
	КонецЕсли;
	
	КоличествоАттракционов = ГСЧ.СлучайноеЧисло(1, 7);
	
	Для Сч = 1 по КоличествоАттракционов Цикл

		ИндексАттрациолна = ГСЧ.СлучайноеЧисло(0, СписокАттракционов.Количество());
		Аттракцион = СписокАттракционов[ИндексАттрациолна];
		
		//@skip-check query-in-loop
		ОснованиеПосещения = ТекущееОснование(Посетитель, Аттракцион);
		
		Если НЕ ЗначениеЗаполнено(ОснованиеПосещения) Тогда
			ОснованиеПосещения = КупитьБилет(Посетитель, Аттракцион);
		КонецЕсли;
		
//		Если Не ЕстьБилет(Посетитель, Аттракцион) Тогда
//			КупитьБилет(Посетитель, Аттракцион);
//		КонецЕсли;
//		
//		ЗарегистрироватьПосещение(Посетитель, Аттракцион); 
		 
	КонецЦикла;
		
КонецПроцедуры


Функция ТекущееОснование(Посетитель, Аттракцион)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.Основание КАК Основание
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание.Клиент = &Посетитель
		|	И ВидАттракциона В
		|		(ВЫБРАТЬ
		|			Аттракционы.ВидАттракциона КАК ВидАттракциона
		|		ИЗ
		|			Справочник.Аттракционы КАК Аттракционы
		|		ГДЕ
		|			Аттракционы.Ссылка = &Аттракцион)) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток > 0";
	
	Запрос.УстановитьПараметр("Аттракцион", Аттракцион);
	Запрос.УстановитьПараметр("Посетитель", Посетитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Основание  //как ДокументСсылка.ПосещениеАттракциона
	КонецЕсли;
	
	Возврат Неопределено


КонецФункции

Функция КупитьБилет(Посетитель, Аттракцион)
	
	ДоступнаяНоменклатура = ДоступнаяНоменклатура(Аттракцмон);
	
КонецФункции

Функция ДоступнаяНоменклатура(Аттракцмон)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидАттракциона В
		|		(ВЫБРАТЬ
		|			Аттракционы.ВидАттракциона КАК ВидАттракциона
		|		ИЗ
		|			Справочник.Аттракционы КАК Аттракционы
		|		ГДЕ
		|			Аттракционы.Ссылка = &Аттракцмон)";
	
	Запрос.УстановитьПараметр("Аттракцмон", Аттракцмон);
 	
 	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")
 	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
