
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура СгенерироватьДанные() Экспорт
	
	ТекстМакета = ПолучитьМакет("СлучайныеФИО").ПолучитьТекст();
	СписокПосетителей = СтрРазделить(ТекстМакета,Символы.ПС);	// Получили массив ФИО из макета
	КоличествоПосетителей = СписокПосетителей.Количество();
	СписокАттракционов = СписокАттракционов();
	
	//Алгоритм  :
	
	// Расчитываем каждый день периода
	// В понедельник парк не работает
	// Определяем сколько посетителей приходит в парк
	// коэффи циент в выходые дни - 1,5 
	// Выбираем случайных посетителей из списка
		
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	
	Курсор = Период.ДатаНачала;
	
	Пока Курсор < Период.ДатаОкончания Цикл
		
		Если ДеньНедели(Курсор)=1 Тогда
			Курсор = Курсор + 86400;
			Продолжить;
		КонецЕсли;
		
		КоэффициентПосетителей =1;
		
		Если ДеньНедели(Курсор)>=6 Тогда
			Курсор = Курсор + 86400; 
			КоэффициентПосетителей = 1.5;
		КонецЕсли;
		
		КоличествоПосетителей = ГСЧ.СлучайноеЧисло(10,30)* КоэффициентПосетителей;
		
		Для НомерПосетителя =1 по КоличествоПосетителей Цикл
			
			ИндексСлучайногоПосетителя = ГСЧ.СлучайноеЧисло(0, 99);
			
			ФИОПосетителя = СписокПосетителей[ИндексСлучайногоПосетителя];
			
			Посетитель = ПолучитьПосетителя(ФИОПОсетителя, ГСЧ);
			
			//@skip-check query-in-loop
			СформироватьПосещенияПосетителя(Посетитель, Курсор, СписокАттракционов, ГСЧ);
			
		КонецЦикла;
		
		Курсор = Курсор + 86400; //Увеличиваем на 1 день т.е. прибавляем количество секунд
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокАттракционов()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Аттракционы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Аттракционы КАК Аттракционы";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьПосетителя(ФИОПОсетителя, ГСЧ)
	
	Резкльтат = Справочники.Клиенты.НайтиПоНаименованию(ФИОПОсетителя,Истина);
	
	Если Не ЗначениеЗаполнено(Резкльтат) Тогда
		СпрОбъект = Справочники.Клиенты.СоздатьЭлемент();
		СпрОбъект.Заполнить(Неопределено);
		СпрОбъект.Наименование = ФИОПОсетителя;
		СпрОбъект.Телефон = СлучайныйТелефон(ГСЧ);
		Если Не СпрОбъект.ПроверитьЗаполнение() Тогда
			ВызватьИсключение "Ошибка содздания кклиента";
		КонецЕсли;
		СпрОбъект.Записать();
		Результат = СпрОбъект.Ссылка;
	КонецЕсли;
		
	Возврат Результат;		
			
КонецФункции

Функция СлучайныйТелефон(ГСЧ)
	
	Результат = "+79";
	Для Сч = 1 по 9 Цикл
		Результат = Результат+ГСЧ.СлучайноеЧисло(0,9);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура СформироватьПосещенияПосетителя(Посетитель, ДатаПосещения, СписокАттракционов, ГСЧ = Неопределено)
	
	// Для каждого посетителя выбираем на сколько аттракционов он пойдет.
	// Проверяем для каждого посещения есть ли билет, если билета нет, покупаем доступный для нужного аттракциона
	// Регистрируем посещение
	
	Если ГСЧ = Неопределено Тогда
		ГСЧ = Новый ГенераторСлучайныхЧисел();
	КонецЕсли;
	
	КоличествоАттракционов = ГСЧ.СлучайноеЧисло(1, 7);
	
	Для Сч = 1 по КоличествоАттракционов Цикл

		ИндексАттрациолна = ГСЧ.СлучайноеЧисло(0, СписокАттракционов.ВГраница());
		Аттракцион = СписокАттракционов[ИндексАттрациолна];
		
		//@skip-check query-in-loop
		ОснованиеПосещения = ТекущееОснование(Посетитель, Аттракцион);
		
		Если НЕ ЗначениеЗаполнено(ОснованиеПосещения) Тогда
			//@skip-check query-in-loop
			ОснованиеПосещения = КупитьБилет(Посетитель, Аттракцион, ДатаПосещения, ГСЧ);
		КонецЕсли;
			
		ЗарегистрироватьПосещение(ОснованиеПосещения, Аттракцион, ДатаПосещения); 
		 
	КонецЦикла;
		
КонецПроцедуры


Функция ТекущееОснование(Посетитель, Аттракцион)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.Основание КАК Основание
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание.Клиент = &Посетитель
		|	И ВидАттракциона В
		|		(ВЫБРАТЬ
		|			Аттракционы.ВидАттракциона КАК ВидАттракциона
		|		ИЗ
		|			Справочник.Аттракционы КАК Аттракционы
		|		ГДЕ
		|			Аттракционы.Ссылка = &Аттракцион)) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток > 0";
	
	Запрос.УстановитьПараметр("Аттракцион", Аттракцион);
	Запрос.УстановитьПараметр("Посетитель", Посетитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Основание  //как ДокументСсылка.ПосещениеАттракциона
	КонецЕсли;
	
	Возврат Неопределено


КонецФункции

Функция КупитьБилет(Посетитель, Аттракцион, ДатаПосещения,ГСЧ)
	
	ДоступнаяНоменклатура = ДоступнаяНоменклатура(Аттракцион);
	
	ИндексНоменклатуры = ГСЧ.СлучайноеЧисло(0, ДоступнаяНоменклатура.ВГраница());
	
	Номенклатура = ДоступнаяНоменклатура[ИндексНоменклатуры];
	
	ДокОбъект = Документы.ПродажаБилета.СоздатьДокумент();
	ДокОбъект.Дата = ДатаПосещения;
	ДокОбъект.Заполнить(Неопределено);
	ДокОбъект.Клиент = Посетитель;
	
	СтрокаТЧ = ДокОбъект.ПозицииПродажи.Добавить();
	СтрокаТЧ.Номенклатура = Номенклатура;
	СтрокаТЧ.Количество = 1; 
	СтрокаТЧ.Цена = РегистрыСведений.ЦеныНоменклатуры.ЦенаНоменклатуры(Номенклатура);
	СтрокаТЧ.Сумма = СтрокаТЧ.Цена*СтрокаТЧ.Количество;
	
	ДокОбъект.СуммаДокумента = ДокОбъект.ПозицииПродажи.Итог("Сумма");
	
	Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение "Ошибка создания продажи";
	КонецЕсли;	
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ДокОбъект.Ссылка;
	
КонецФункции

Функция ДоступнаяНоменклатура(Аттракцмон)
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ВидАттракциона В
		|		(ВЫБРАТЬ
		|			Аттракционы.ВидАттракциона КАК ВидАттракциона
		|		ИЗ
		|			Справочник.Аттракционы КАК Аттракционы
		|		ГДЕ
		|			Аттракционы.Ссылка = &Аттракцмон)";
	
	Запрос.УстановитьПараметр("Аттракцмон", Аттракцмон);
 	
 	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка")
 	
КонецФункции

Процедура ЗарегистрироватьПосещение(ОснованиеПосещения, Аттракцион, ДатаПосещения)
	
	ДокОбъект = Документы.ПосещениеАттракциона.СоздатьДокумент();
	ДокОбъект.Заполнить(Неопределено);
	ДокОбъект.Дата = ДатаПосещения;
	ДокОбъект.Основание = ОснованиеПосещения;
	ДокОбъект.Аттракцион = Аттракцион;
	
	Если Не ДокОбъект.ПроверитьЗаполнение() Тогда
		ВызватьИсключение "Не удалось записать посещение"
	КонецЕсли;
	
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
