
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ТекстВопроса = НСтр("ru = 'В таблице уже введены цена.Таблица будет очищена. Продолжить?'" );
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Файл EXL|*.xlsx'" );
	
	РезультатПомещения = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	
	Если РезультатПомещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПомещения.ПомещениеФайлаОтменено Тогда
		Возврат
	КОнецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресФайла",РезультатПомещения.Адрес);  //Это Параметр из формы 
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаЗагрузкиИзФайла", ПараметрыФормы,,,,, Оповещение);
	
	// ОбработатьФайлЦен(РезультатПомещения.Адрес);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьФайлЦен(Адрес)
	
//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
//	ИмяФайла = ПолучитьИмяВременногоФайла("Xlsx");
//	
//	ДвоичныеДанные.Записать(ИмяФайла); 
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.Прочитать(ИмяФайла);
//	
//	Объект.ЦеныНоменклатуры.Очистить();
//	
//	Для НомерСтроки = 2 по ТабличныйДокумент.ВысотаТаблицы цикл
//		
//		Наименование = ТабличныйДокумент.Область(НомерСтроки,1).Текст;
//		Цена = ТабличныйДокумент.Область(НомерСтроки,2).Текст;
//				
//		Строка = Объект.ЦеныНоменклатуры.Добавить();
//		Строка.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
//		Строка.Цена = Число(Цена);
//		
//	КонецЦикла;
//		
//	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

#КонецОбласти
