
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//СТандартныеПодсистемы
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	//СТандартныеПодсистемы
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи );
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ТекстВопроса = НСтр("ru = 'В таблице уже введены цена.Таблица будет очищена. Продолжить?'" );
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Файл EXL|*.xlsx'" );
	
	РезультатПомещения = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	
	Если РезультатПомещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПомещения.ПомещениеФайлаОтменено Тогда
		Возврат
	КОнецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресФайла",РезультатПомещения.Адрес);  //Это Параметр из формы 
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаЗагрузкиИзФайла", ПараметрыФормы,,,,, Оповещение);
	
	// ОбработатьФайлЦен(РезультатПомещения.Адрес);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ЗагрузитьЦеныИзВременногоХранилища(Результат);
	
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЦеныИзВременногоХранилища(Адрес)
	Объект.ЦеныНоменклатуры.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
КонецПроцедуры	


&НаСервере
Процедура ОбработатьФайлЦен(Адрес)
	
//	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
//	ИмяФайла = ПолучитьИмяВременногоФайла("Xlsx");
//	
//	ДвоичныеДанные.Записать(ИмяФайла); 
//	
//	ТабличныйДокумент = Новый ТабличныйДокумент;
//	ТабличныйДокумент.Прочитать(ИмяФайла);
//	
//	Объект.ЦеныНоменклатуры.Очистить();
//	
//	Для НомерСтроки = 2 по ТабличныйДокумент.ВысотаТаблицы цикл
//		
//		Наименование = ТабличныйДокумент.Область(НомерСтроки,1).Текст;
//		Цена = ТабличныйДокумент.Область(НомерСтроки,2).Текст;
//				
//		Строка = Объект.ЦеныНоменклатуры.Добавить();
//		Строка.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Наименование);
//		Строка.Цена = Число(Цена);
//		
//	КонецЦикла;
//		
//	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

#Область ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Пожключаемый_ПродолжиьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект,ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
#КонецОбласти

#КонецОбласти
