
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура Загрузить(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Фильтр = НСтр("ru = 'Файл EXL|*.xlsx'" );
	
	РезультатПомещения = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	
	Если РезультатПомещения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатПомещения.ПомещениеФайлаОтменено Тогда
		Возврат
	КОнецЕсли;
	
	ОбработатьФайлЦен(РезультатПомещения.Адрес);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбработатьФайлЦен(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ИмяФайла = ПолучитьИмяВременногоФайла("Xlsx");
	
	ДвоичныеДанные.Записать(ИмяФайла); 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла);
	
	Объект.ЦеныНоменклатуры.Очистить()
	Для НомерСтроки = 2 по ТабличныйДокумент.ВысотаТаблицы цикл
		
		Наименование = ТабличныйДокумент.Область(НомерСтроки,1).тек
		
		Строка = Объект.ЦеныНоменклатуры.Добавить()
		
	КонецЦикла;
	
	
	УдалитьФайлы(ИмяФайла);
КонецПроцедуры

#КонецОбласти
