
#Область ПрограммныйИнтерфейс

Процедура ПеренестиПользователейИзПредыдущейВерсии() Экспорт
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПА_Пользователи.Ссылка КАК Ссылка,
		|	ПА_Пользователи.Наименование КАК Наименование,
		|	ПА_Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	Справочник.ПА_Пользователи КАК ПА_Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Пользователи.ИдентификаторПользователяИБ = ПА_Пользователи.ИдентификаторПользователяИБ
		|ГДЕ
		|	Пользователи.Ссылка ЕСТЬ NULL
		|	И ПА_Пользователи.ИдентификаторПользователяИБ <> &ПустойИдентификатор";
	
	Запрос.УстановитьПараметр("ПустойИдентификатор",ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		НачатьТранзакцию();
		
		Попытка
			
			ПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
			ПользовательОбъект.Наименование = Выборка.Наименование;
			ПользовательОбъект.ИдентификаторПользователяИБ = Выборка.ИдентификаторПользователяИБ;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(ПользовательОбъект);
			
			НазначитьПрофилиГруппДоступа(ПользовательОбъект.Ссылка,Выборка.ИдентификаторПользователяИБ);
						
			ЗафиксироватьТранзакцию();
		
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	
	КонецЦикла;
	
	
	
КонецПроцедуры

Процедура НазначитьПрофилиГруппДоступа(Пользователь, ИдентификаторПользователяИБ)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ИдентификаторПользователяИБ);
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоАдминистратор = Ложь;
	ЭтоКассир = Ложь;
	ЭтоОператорАттракциона = Ложь;
	
	Для Каждого Роль Из ПользовательИБ.Роли Цикл
		
		Если Роль = Метаданные.Роли.ПА_ПолныеПрава Тогда
			ЭтоАдминистратор = Истина
		ИначеЕсли Роль = Метаданные.Роли.Кассир Тогда
			ЭтоКассир = Истина
		ИначеЕсли Роль = Метаданные.Роли.ОператорАттракционов Тогда
			ЭтоОператорАттракциона = Истина
		КонецЕсли;
		
	КонецЦикла; 

	Если ЭтоАдминистратор Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь,"Администратор" );
	КонецЕсли;  
	Если ЭтоКассир Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь,"Кассир" );
	КонецЕсли;
	Если ЭтоОператорАттракциона Тогда
		УправлениеДоступом.ВключитьПрофильПользователю(Пользователь,"ОператорАттракционов" );
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
