
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выгрузить(Команда)
	
	АдресАрхива = ВыгрузитьСервер();
	
	ПараметрыДиаолога = Новый ПараметрыДиалогаПолученияФайлов;
	
	ПолучитьФайлССервераАсинх(АдресАрхива, "export.zip", ПараметрыДиаолога);
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВыгрузитьСервер()
	// переносим выполнение в модуль объекта
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	АдресАрхива = ОбработкаОбъект.ПодготовитьАрхив();
	Возврат АдресАрхива;
	
КонецФункции


#КонецОбласти
