
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьСервер()
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьСервер()
	// переносим выполнение в модуль объекта
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	АдресАрхива = ОбработкаОбъект.ПодготовитьАрхив();
	
КонецПроцедуры


#КонецОбласти
