
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Переход1002(Команда)
	Переход1002НаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Процедура Переход1002НаСервере()
	 
	 Документы.ПродажаБилета.ПеренестиНоменклатуруВТабличнуюЧасть();
	  
КонецПроцедуры
#КонецОбласти

