
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформитроватьДиаграммуПосещенияАттракционов()
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформитроватьДиаграммуПосещенияАттракционов()
КонецПроцедуры

&НаКлиенте
Процедура ПосещениеАттракционовВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	Аттракцион = ЗначениеДиаграммы.Серия.Значение;
	День = ЗначениеДиаграммы.Точка.Значение;
	
	
	//переходим в отчет из диаграммы
	
	ПользовательскиеНастройки = НастройкиОтчетаДетализацииПосещений(Аттракцион, День); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПользовательскиеНастройки);
	
	ОткрытьФорму("Отчет.ДетализацияПосещений.ФормаОбъекта",ПараметрыФормы)
	
КонецПроцедуры

&НаКлиенте
Процедура ПосещениеАттракционовОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	СформитроватьДиаграммуПосещенияАттракционов();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформитроватьДиаграммуПосещенияАттракционов()
	
	ПосещениеАттракционов.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПосещениеАттракционовОстаткиИОбороты.Период КАК День,
		|	ПосещениеАттракционовОстаткиИОбороты.Аттракцион КАК Аттракцион,
		|	ПосещениеАттракционовОстаткиИОбороты.КоличествоОборот КАК КоличествоПосещений
		|ИЗ
		|	РегистрНакопления.ПосещениеАттракционов.ОстаткиИОбороты(&НачалоПериода,&КонецПериода, День,,) КАК ПосещениеАттракционовОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	День";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала );
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Точка = ПосещениеАттракционов.УстановитьТочку(Выборка.День);
		Точка.Текст = Формат(Выборка.День,"ДЛФ=D;");
		Серия = ПосещениеАттракционов.УстановитьСерию(выборка.Аттракцион);
		
		ПосещениеАттракционов.УстановитьЗначение(Точка, Серия, Выборка.КоличествоПосещений);
		
	КонецЦикла;
	
	ВремяПоследнегоОбновления = ТекущаяДатаСеанса(); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкиОтчетаДетализацииПосещений(Аттракцион, День)
	
	Отчет = Отчеты.ДетализацияПосещений.Создать();
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПользовательскийПараметрПериод = ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);	 
	
	ЗначениеПараметраПериод = Новый СтандартныйПериод;
	ЗначениеПараметраПериод.ДатаНачала = НачалоДня(День);
	ЗначениеПараметраПериод.ДатаОкончания = КонецДня(День);
	ПользовательскийПараметрПериод.Значение = ЗначениеПараметраПериод; 
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

#КонецОбласти
