#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформитроватьДиаграмму()
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СформитроватьДиаграмму()
КонецПроцедуры

&НаКлиенте
Процедура ПосещениеАттракционовВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	
	Аттракцион = ЗначениеДиаграммы.Серия.Значение;
	День = ЗначениеДиаграммы.Точка.Значение;
	
	
	//переходим в отчет из диаграммы
	
	ПользовательскиеНастройки = НастройкиОтчетаДетализацииПосещений(Аттракцион, День); 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПользовательскиеНастройки",ПользовательскиеНастройки);
	ПараметрыФормы.Вставить("СформироватьПриОткрытии", Истина);
	
	ОткрытьФорму("Отчет.ДетализацияПосещений.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосещениеАттракционовОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Обновить(Команда)
	СформитроватьДиаграмму();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформитроватьДиаграмму()
	
	СформитроватьДиаграммуПосещениеАттракциона();
	СформитроватьДиаграммуРаспределениеАттракционов();
	
	ВремяПоследнегоОбновления = ТекущаяДатаСеанса(); 
	
КонецПроцедуры

&НаСервере
Процедура СформитроватьДиаграммуПосещениеАттракциона()
	
	ПосещениеАттракционов.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПосещениеАттракционовОстаткиИОбороты.Период КАК День,
		|	ПосещениеАттракционовОстаткиИОбороты.Аттракцион КАК Аттракцион,
		|	ПосещениеАттракционовОстаткиИОбороты.КоличествоОборот КАК КоличествоПосещений
		|ИЗ
		|	РегистрНакопления.ПосещениеАттракционов.ОстаткиИОбороты(&НачалоПериода,&КонецПериода, День,,) КАК ПосещениеАттракционовОстаткиИОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	День";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала );
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Точка = ПосещениеАттракционов.УстановитьТочку(Выборка.День);
		Точка.Текст = Формат(Выборка.День,"ДЛФ=D;");
		Серия = ПосещениеАттракционов.УстановитьСерию(выборка.Аттракцион);
		
		ПосещениеАттракционов.УстановитьЗначение(Точка, Серия, Выборка.КоличествоПосещений);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформитроватьДиаграммуРаспределениеАттракционов()
	
	РаспределениеАттракционов.Очистить();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПосещениеАттракционовОстаткиИОбороты.Аттракцион КАК Аттракцион,
		|	ПосещениеАттракционовОстаткиИОбороты.КоличествоОборот КАК КоличествоПосещений,
		|	ПосещениеАттракционовОстаткиИОбороты.Аттракцион.ВидАттракциона КАК ВидАттракциона
		|ИЗ
		|	РегистрНакопления.ПосещениеАттракционов.ОстаткиИОбороты(&НачалоПериода, &КонецПериода,,,) КАК
		|		ПосещениеАттракционовОстаткиИОбороты
		|ИТОГИ
		|	СУММА(КоличествоПосещений)
		|ПО
		|	ВидАттракциона";
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала );
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания );
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаВидыАттракционов = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаВидыАттракционов.Следующий() Цикл
	
		Точка = РаспределениеАттракционов.УстановитьТочку("Виды аттракционов");
		Серия = РаспределениеАттракционов.УстановитьСерию(ВыборкаВидыАттракционов.ВидАттракциона);
		
		РаспределениеАттракционов.УстановитьЗначение(Точка, Серия, ВыборкаВидыАттракционов.КоличествоПосещений);
		
		ВыборкаАттракционы = ВыборкаВидыАттракционов.Выбрать();
		
		Пока ВыборкаАттракционы.Следующий() Цикл
			Точка = РаспределениеАттракционов.УстановитьТочку("Аттракционы");
			Серия = РаспределениеАттракционов.УстановитьСерию(ВыборкаАттракционы.Аттракцион);
		
			РаспределениеАттракционов.УстановитьЗначение(Точка, Серия, ВыборкаАттракционы.КоличествоПосещений);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция НастройкиОтчетаДетализацииПосещений(Аттракцион, День)
	
	Отчет = Отчеты.ДетализацияПосещений.Создать();
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	ПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки;
	
	// Установка парметра Период
	ПараметрПериод = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ПользовательскийПараметрПериод = 
		ПользовательскиеНастройки.Элементы.Найти(ПараметрПериод.ИдентификаторПользовательскойНастройки);	 
	
	ЗначениеПараметраПериод = Новый СтандартныйПериод;
	ЗначениеПараметраПериод.ДатаНачала = НачалоДня(День);
	ЗначениеПараметраПериод.ДатаОкончания = КонецДня(День);
	ПользовательскийПараметрПериод.Значение = ЗначениеПараметраПериод;
	
	//Установка подбора Аттракцион
	ПолеДляОтбора = Новый ПолеКомпоновкиДанных("Аттракцион");
	Для каждого ЭлементОтбора из Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеДляОтбора Тогда
			ПользовательскийПараметрАттракцион = 
				ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
			ПользовательскийПараметрАттракцион.Использование = Истина;
			ПользовательскийПараметрАттракцион.ПравоеЗначение = Аттракцион;
			Прервать; 
			
		КонецЕсли;
		
	КонецЦикла;  
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

#КонецОбласти
