 


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	Настройки.ПриДобавленииКомандПЕчати = Истина;
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	Команда = КомандыПечати.Добавить();
	Команда.Идентификатор = "Билет";
	Команда.Представление = НСтр("ru = 'Билет'");
	Команда.ПроверкаПроведенияПередПечатью = Истина;
	Команда.Порядок = 10;
	
	Команда = КомандыПечати.Добавить();
	Команда.Идентификатор = "Реклама";
	Команда.Представление = НСтр("ru = 'Реклама'");
	Команда.ПроверкаПроведенияПередПечатью = Истина;
	Команда.Порядок = 20;
	
	Команда = КомандыПечати.Добавить();
	Команда.Идентификатор = "Билет,Реклама";
	Команда.Представление = НСтр("ru = 'Комплект с рекламой при продаже'");
	Команда.ПроверкаПроведенияПередПечатью = Истина;
	Команда.Порядок = 30;
	
КонецПроцедуры


Процедура Печать (МассивОбъектов, ПараметрыПечать, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Билет" );
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьБилета (МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Билет'"); 
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ПродажаБилета.ПФ_MXL_Билет"
	КонецЕсли;
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "Реклама" );
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ПечатьРекламы (МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Реклама'"); 
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.ПродажаБилета.ПФ_MXL_Реклама"
	КонецЕсли;
	
КонецПроцедуры

// Переход на новую версию
Процедура ПеренестиНоменклатуруВТабличнуюЧасть () Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаБилета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПродажаБилета КАК ПродажаБилета
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПродажаБилета.ПозицииПродажи КАК ПродажаБилетаПозицииПродажи
		|		ПО ПродажаБилетаПозицииПродажи.Ссылка = ПродажаБилета.Ссылка
		|		И ПродажаБилетаПозицииПродажи.НомерСтроки = 1
		|ГДЕ
		|	ПродажаБилета.УдалитьНоменклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И ПродажаБилетаПозицииПродажи.Ссылка ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Строка = ДокОбъект.ПозицииПродажи.Добавить();
		Строка.Номенклатура = ДокОбъект.УдалитьНоменклатура;
		Строка.цена = ДокОбъект.УдалитьЦена;
		Строка.Количество = 1;
		Строка.сумма = Строка.Цена;
		
		ДокОбъект.ОбменДанными.Загрузка = Истина; // отключаем автоматическую проверку проведения и т.п. для ускорения процесса 
		ДокОбъект.Записать();
	КонецЦикла;
	
	
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьБилета (МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПродажаБилета.ПФ_MXL_Билет");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаБилета.Номер КАК Номер,
		|	ПродажаБилета.Дата КАК Дата,
		|	ПродажаБилета.СуммаДокумента КАК СуммаДокумента,
		|	ПродажаБилета.Ссылка КАК Ссылка,
		|	ПродажаБилета.ПозицииПродажи.(
		|		Номенклатура КАК Номенклатура,
		|		Цена КАК Цена,
		|		Количество КАК Количество,
		|		Сумма КАК Сумма,
		|		Номенклатура.КоличествоПосещений КАК КоличествоПосещений) КАК ПозицииПродажи
		|ИЗ
		|	Документ.ПродажаБилета КАК ПродажаБилета
		|ГДЕ
		|	ПродажаБилета.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОписаниеТоваров = Макет.ПолучитьОбласть("ОписаниеТоваров");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы +1;
		
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD;") );
		//ПараметрыОбласти.Вставить("Номер",Число(Выборка.Номер)  );
		
		// Другой способ убрать 0 из номера документа
		ПараметрыОбласти.Вставить("Номер",УбратьЛидирующиеНули(Выборка.Номер) );
				
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ВыборкаПохицииПродажи = Выборка.ПозицииПродажи.Выбрать();
		Пока ВыборкаПохицииПродажи.Следующий() Цикл
			ОписаниеТоваров.Параметры.Заполнить(ВыборкаПохицииПродажи);
			ТабличныйДокумент.Вывести(ОписаниеТоваров);	
		КонецЦикла;
		
		ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(Выборка.Номер, 3, 120);
				
		КартинкаQRКода = Новый Картинка(ДанныеQRКода);
		Подвал.Рисунки.QRКод.Картинка = КартинкаQRКода;		
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабличныйДокумент.Вывести(Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		 
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

Функция ПечатьРекламы (МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПродажаБилета.ПФ_MXL_Реклама");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаБилета.Номер КАК Номер,
		|	ПродажаБилета.Дата КАК Дата,
		|	ПродажаБилета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПродажаБилета КАК ПродажаБилета
		|ГДЕ
		|	ПродажаБилета.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	
	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы +1;
		
		ПараметрыОбласти = Новый Структура;
		ПараметрыОбласти.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=DD;") );
		//ПараметрыОбласти.Вставить("Номер",Число(Выборка.Номер)  );
		
		// Другой способ убрать 0 из номера документа
		ПараметрыОбласти.Вставить("Номер",УбратьЛидирующиеНули(Выборка.Номер) );
				
		ОбластьЗаголовок.Параметры.Заполнить(ПараметрыОбласти);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		 
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции



Функция УбратьЛидирующиеНули (Номер);

	Результат = Номер;
	Пока СтрНачинаетсяС(Результат,"0" ) Цикл
		Результат = Сред(Результат,2);
	КонецЦикла;
	Возврат Результат		
КонецФункции

#КонецОбласти

#КонецЕсли

