#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбработатьФайлЦен(Параметры.АдресФайла);
	
	ПодобратьНоменклатуру();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьФайлЦен(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ИмяФайла = ПолучитьИмяВременногоФайла("Xlsx");
	
	ДвоичныеДанные.Записать(ИмяФайла); 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла);
	
	//Объект.ЦеныНоменклатуры.Очистить();
	
	Для НомерСтроки = 2 по ТабличныйДокумент.ВысотаТаблицы цикл
		
		Наименование = ТабличныйДокумент.Область(НомерСтроки,1).Текст;
		Цена = ТабличныйДокумент.Область(НомерСтроки,2).Текст;
				
		Строка = ДанныеФайла.Добавить();
		Строка.Наименование = Наименование;	
		Строка.Цена = Число(Цена);
		
	КонецЦикла;
		
	УдалитьФайлы(ИмяФайла);
	
КонецПроцедуры

&НаСервере
Процедура ПодобратьНоменклатуру()
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Наименование КАК Наименование,
		|	Т.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ДанныеФайла
		|ИЗ
		|	&ДанныеФайла КАК Т 
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеФайла.Наименование КАК Наименование,
		|	ВТ_ДанныеФайла.Цена КАК Цена,
		|	МАКСИМУМ(Номенклатура.Ссылка) КАК Номенклатура
		|ИЗ
		|	ВТ_ДанныеФайла КАК ВТ_ДанныеФайла
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ВТ_ДанныеФайла.Наименование = Номенклатура.Наименование
		|		И НЕ Номенклатура.ПометкаУдаления
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеФайла.Наименование,
		|	ВТ_ДанныеФайла.Цена";
		
		Запрос.УстановитьПараметр("ДанныеФайла", ДанныеФайла.Выгрузить());
		
		ДанныеФайла.Загрузить(Запрос.Выполнить().Выгрузить( ));
	
КонецПроцедуры

#КонецОбласти
