
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Перенос файлов картинк с ододного реквизита в другой
// Для запуска этой процедуры надо внести изменения в общиймодуль  ОбновлениеИнформационнойБазыПА
// а затем изменить изменить версию конфигурации (в св-вах) на такуюже как в общем модуле

Процедура ПеренестиТелефонВКонтактнуюИнформацию(ПараметрыОбработки) Экспорт
	
	// НЕ РАБОТАЕТ,  в консоле кода с отдельным элементом работает ,а в обработке нет
	
	ПараметрыОбработки.ОбработкаЗавершена = Ложь;
	
	ВидКИТелефонаКлиента = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 50
		|	Клиенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Клиенты КАК Клиенты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты.КонтактнаяИнформация КАК КлиентыКонтактнаяИнформация
		|		ПО КлиентыКонтактнаяИнформация.Ссылка = Клиенты.Ссылка
		|		И КлиентыКонтактнаяИнформация.Вид = &ВидКИТелефонаКлиента
		|ГДЕ
		|	КлиентыКонтактнаяИнформация.Ссылка ЕСТЬ NULL
		|	И Клиенты.НормализованныйТелефон <> """"";
		
	Запрос.УстановитьПараметр("ВидКИТелефонаКлиента", ВидКИТелефонаКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой()Тогда
		ПараметрыОбработки.ОбработкаЗавершена = Истина;	
		Возврат;
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.НоваяКонтактнаяИнформация();
		НоваяСтрока = КонтактнаяИнформация.Добавить();
		НоваяСтрока.Вид = ВидКИТелефонаКлиента;
				
		//СпрОбъект.УдалитьТелефон = "";
		
		НомерТелефонаКИ = "";
		ВидКИ = УправлениеКонтактнойИнформацией.ВидКонтактнойИнформацииПоИмени("ТелефонКлиента");
		Для Каждого Строка Из КонтактнаяИнформация Цикл
			Если Строка.Вид = ВидКИ Тогда
				НоваяСтрока.Представление = СпрОбъект.НормализованныйТелефон;
			КонецЕсли;			
		КонецЦикла;
		
		НоваяСтрока.Объект = СпрОбъект;
		УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(СпрОбъект, КонтактнаяИнформация, Ложь);
		//ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СпрОбъект);
		СпрОбъект.Записать();

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
