
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкаОтчета) Экспорт
	
	НастройкиВарианта =
	 ВариантыОтчетов.ОписаниеВарианта(Настройки, Метаданные.Отчеты.ДетализацияПосещений, "ДетализацияПосещений");
	НастройкиВарианта.Описание = НСтр("ru = 'Детальный список посещений аттракционов'");
	НастройкиВарианта.Размещение.Вставить(ВариантыОтчетовКлиентСервер.ИдентификаторНачальнойСтраницы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
