
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
//	// Определяем родительский элемент для страниц
//ПеременнаяГруппаСтраницы = Элементы.Найти("Страницы");
//Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   	ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   	ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//КонецЕсли;
//
//// Создаём новую страницу (вкладку)
//Если ЭлементыФормы.Найти("ГруппаСертификация") = Неопределено Тогда
//    ПеременнаяГруппаСертификация = ЭлементыФормы.Вставить("ГруппаСертификация", Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//    ПеременнаяГруппаСертификация.Вид = ВидГруппыФормы.Страница;
//    ПеременнаяГруппаСертификация.Заголовок = "Сертификация";
//КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПутьКФайлуОписанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл прайс листа";
	ВыбранныйФильтр = "Документ Word (.doc)|*.doc?"; 
	Проводник.Фильтр = ВыбранныйФильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОписанияОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОписанияОткрытие(Элемент, СтандартнаяОбработка)
	Если объект.ПутьКФайлуОписания <> "" Тогда
		СтандартнаяОбработка = Ложь;  // не выводит стандартное окно оповещения  
		ЗапуститьПриложение (Объект.ПутьКФайлуОписания);
	КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧОписание
&НаКлиенте
Процедура ТЧОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТЧОписаниеПутьКФайлуОписания" Тогда
        СтандартнаяОбработка = Ложь; // Отменяем стандартное поведение
        
        // Получаем данные текущей строки
        ТекДанные = Элементы.ТЧОписание.ТекущиеДанные;
        Если ТекДанные <> Неопределено Тогда
            // Здесь можно реализовать код для открытия файла по пути, хранящемуся в данных строки
            ЗапуститьПриложение(ТекДанные.СсылкаНаОписание); // Пример: использование функции ЗапуститьПриложение
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт 
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Файл для загрузки не выбран");
		Объект.ПутьКФайлуОписания = "";
		Возврат;
	КонецЕсли;
			
	Объект.ПутьКФайлуОписания = ВыбранныеФайлы[0];
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлуОписания); 
	
	ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла);
КонецПроцедуры

//Конвертирует в zip документ docx и читает файл comments.xml из разархивированной папки
//
// Параметры:
//  ДвоичныеДанныеФайла	 - Двоичные данные - Двоичные данные файла Word, который необходимо прочитать
// 
// Возвращаемое значение:
// Строка - Все примечания, которые есть в документе строкой 
//
Функция ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
	КопироватьФайл(ПутьКФайлу, СтрЗаменить(ПутьКФайлу, "docx", "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(ПутьКФайлу, "docx", "zip");
	
	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	
	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть(); 
	
	//В этом отдельном файле хранятся примечания скопом
	Файл = Новый Файл(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		
	СтрокаПримечания = "";	
	//Если Файл.Существует() Тогда		
		//СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/document.xml");
			
	//КонецЕсли;
			
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ПутьКФайлу);
	УдалитьФайлы(ИмяФайлаСПутемZIP);
	
	Возврат СтрокаПримечания;
	
КонецФункции

//Ищет теги примечания и берет текстовое значение в указанном файле.Учитываются комментарии только начинающиеся со знака "#"
//
// Параметры:
//  ПутьКФайлу	 - 	Строка  - Путь к xml файлу, который нужно прочитать
// 
// Возвращаемое значение:
// Строка  - прочитанные значения (текст примечаний через перенос строки)
//
Функция XMLComments(ПутьКФайлу)
	
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(ПутьКФайлу);
	
	МассивПримечания = Новый Массив;
	
	НачалсяКомментарий = Ложь;
	Пока Файл.Прочитать() Цикл			
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Истина;
			СтрокаПримечаний = "";
			Продолжить;
		КонецЕсли;
		
		Если НачалсяКомментарий И Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрокаПримечаний = СтрокаПримечаний + Файл.Значение;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Ложь;
			МассивПримечания.Добавить(СтрокаПримечаний);
		КонецЕсли;		
	КонецЦикла;
	
	Файл.Закрыть();
	
	Сообщить("Привет" + СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС));
			
	Возврат СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС);

КонецФункции
#КонецОбласти
