
#Область ОписаниеПеременных
Перем СтраницыИзХранилищаЗначений Экспорт; 

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//ДанныеХранилища = ПрочитатьПутьКФАйлуОписания();
//	Если ПутьКФайлуСтраницы = Неопределено Тогда
//		// Если нет ни одного выбранного файла, то програмно создаем СтраницЫ
//		// Определяем родительский элемент для страниц
//		ПеременнаяГруппаСтраницы = Элементы.Найти("Страницы");
//			Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   				ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   				ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//			КонецЕсли;
//
//		// Создаём новую страницу (вкладку)
//		Если Элементы.Найти("ГруппаСертификация") = Неопределено Тогда
//		    ПеременнаяГруппаСертификация = Элементы.Вставить("ГруппаСертификация", Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//		    ПеременнаяГруппаСертификация.Вид = ВидГруппыФормы.Страница;
//		    ПеременнаяГруппаСертификация.Заголовок = "Сертификация";
//		КонецЕсли;
//		ПутьКФайлуМассив = Новый Массив;
//		ПутьКФайлуМассив[0] = "жфжывдлоыва";
//		Элементы.ОписаниеХранилищеЗначений.Записать(ПутьКФайлуМассив);
//		
//	КонецЕсли;

	
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьПутьКФАйлуОписания()
	Если ЗначениеЗаполнено(Объект.ОписаниеХранилищеЗначений) Тогда
		ДанныеХр = Объект.ОписаниеХранилищеЗначений.Получить();
		Возврат ДанныеХр;
	КонецЕсли; 
	Возврат Неопределено;
КонецФункции


//  
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СтраницыИзХранилищаЗначений = ТекущийОбъект.ОписаниеХранилищеЗначений.Получить();
	ИзменитьФорму();  //Програмно добавляю вкладки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//СтраницыИзХранилищаЗначений = Неопределено;
	ТекущийОбъект.ОписаниеХранилищеЗначений = Новый ХранилищеЗначения(СтраницыИзХранилищаЗначений);
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл прайс листа";
	ВыбранныйФильтр = "Документ Word (.doc)|*.doc?"; 
	Проводник.Фильтр = ВыбранныйФильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	Если объект.ОписаниеХранилищеЗначений <> "" Тогда
		СтандартнаяОбработка = Ложь;  // не выводит стандартное окно оповещения  
		ЗапуститьПриложение (Объект.ПутьКФайлу);
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура КомментарийРасположениеПриИзменении(Элемент)
	Если Объект.КомментарийРасположение = "" Тогда
		Элементы.ДобавитьОисание.Доступность = Ложь;
	Иначе 
		Элементы.ДобавитьОисание.Доступность = Истина;
	КОнецЕсли 
	//КомментарийРасположениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРасположениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ДобавитьОисание.Доступность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧОписание
&НаКлиенте
Процедура ТЧОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТЧОписаниеПутьКФайлуОписания" Тогда
        СтандартнаяОбработка = Ложь; // Отменяем стандартное поведение
        
        // Получаем данные текущей строки
        ТекДанные = Элементы.ТЧОписание.ТекущиеДанные;
        Если ТекДанные <> Неопределено Тогда
            // Здесь можно реализовать код для открытия файла по пути, хранящемуся в данных строки
            ЗапуститьПриложение(ТекДанные.СсылкаНаОписание); // Пример: использование функции ЗапуститьПриложение
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьОисание(Команда)

		Объект.КомментарийРасположение = "";
		Элементы.ДобавитьОисание.Доступность = Ложь;
		НазваниеСтараницы = "Страница" + СтраницыИзХранилищаЗначений.Количество();
		//ИзменитьФорму();
		//НазваниеСтраницы = Объект.стра
		//НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,ГруппаСтраниц,Объект.КомментарийРасположение,1,1);
		//ДФИ.СоздатьКоманду(ЭтотОбъект,"ПриветИнфостарт","Проверка","СообщитьПриветИнфостарт");
		//ДФИ.СздКнопка(ЭтотОбъект,"Проверка",НоваяСтраница,"Поздароваться","ПриветИнфостарт",2);
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт 
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Файл для загрузки не выбран");
		Объект.ПутьКФайлуСтраницы = "";
		Возврат;
	КонецЕсли;
	ПутьКФайлуСтраницы = ВыбранныеФайлы[0];
	//ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлуСтраницы); 
	
	//ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла);
КонецПроцедуры

//Конвертирует в zip документ docx и читает файл comments.xml из разархивированной папки
//
// Параметры:
//  ДвоичныеДанныеФайла	 - Двоичные данные - Двоичные данные файла Word, который необходимо прочитать
// 
// Возвращаемое значение:
// Строка - Все примечания, которые есть в документе строкой 
//
Функция ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
	КопироватьФайл(ПутьКФайлу, СтрЗаменить(ПутьКФайлу, "docx", "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(ПутьКФайлу, "docx", "zip");
	
	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	
	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть(); 
	
	//В этом отдельном файле хранятся примечания скопом
	Файл = Новый Файл(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		
	СтрокаПримечания = "";	
	//Если Файл.Существует() Тогда		
		//СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/document.xml");
			
	//КонецЕсли;
			
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ПутьКФайлу);
	УдалитьФайлы(ИмяФайлаСПутемZIP);
	
	Возврат СтрокаПримечания;
	
КонецФункции

//Ищет теги примечания и берет текстовое значение в указанном файле.Учитываются комментарии только начинающиеся со знака "#"
//
// Параметры:
//  ПутьКФайлуСтраницы	 - 	Строка  - Путь к xml файлу, который нужно прочитать
// 
// Возвращаемое значение:
// Строка  - прочитанные значения (текст примечаний через перенос строки)
//
Функция XMLComments(ПутьКФайлу)
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(ПутьКФайлу);
	
	МассивПримечания = Новый Массив;
	
	НачалсяКомментарий = Ложь;
	Пока Файл.Прочитать() Цикл			
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Истина;
			СтрокаПримечаний = "";
			Продолжить;
		КонецЕсли;
		
		Если НачалсяКомментарий И Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрокаПримечаний = СтрокаПримечаний + Файл.Значение;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Ложь;
			МассивПримечания.Добавить(СтрокаПримечаний);
		КонецЕсли;		
	КонецЦикла;
	
	Файл.Закрыть();
	
	Сообщить("Привет" + СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС));
			
	Возврат СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС);

КонецФункции

&НаСервере
Процедура ИзменитьФорму()
	//Если ПутьКФайлуСтраницы = Неопределено Тогда
		
	//Иначе
//		ПеременнаяГруппаСтраницы = Элементы.Найти("СтраницаГлавная");
//			Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   				ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   				ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//			КонецЕсли;
//		Для Индекс = 2 По 5 Цикл
//		// Создаём новую страницу (вкладку)
//		//Если Элементы.Найти("ГруппаСертификация") = Неопределено Тогда
//			НазваниеНадписи = "Надпись"+Строка(Индекс);
//			НазваниеСтраницы = "Страница"+Строка(Индекс);
//			НазваниеКоманды = "Команда"+Строка(Индекс);
//		    НоваяСтраница = Элементы.Вставить(НазваниеСтраницы, Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//		    НоваяСтраница.Вид = ВидГруппыФормы.Страница;
//		    НоваяСтраница.Заголовок = "Сертификация";
//		    НовыйЭлемент2 = Элементы.Добавить(НазваниеНадписи,Тип("ДекорацияФормы"), НоваяСтраница);
//    		НовыйЭлемент2.Заголовок = "НоваяНадпись"+Строка(Индекс);
//    		НовыйЭлемент3 = Команды.Добавить(НазваниеКоманды);
//    		НовыйЭлемент3.Заголовок = "Удалить";
//    		НовыйЭлемент3.Действие = "УдалитьСтраницу"
//    	КонецЦикла;
//		//КонецЕсли;

//		ГруппаШапка = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаШапка",ЭтотОбъект,3,1);
//		ГруппаШапкаЛево = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,"ГруппаШапкаЛево",ГруппаШапка,1); 
//		ГруппаШапкаПраво = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,"ГруппаШапкаПраво",ГруппаШапка,1);
	//СтраницыИзХранилищаЗначений = ЭтотОбъект.ОписаниеХранилищеЗначений.Получить();
	Если СтраницыИзХранилищаЗначений = Неопределено Тогда
		СтраницыИзХранилищаЗначений = Новый Массив;
		СтраницаИзХЗ = Новый Структура ("НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначений.Добавить(СтраницаИзХЗ); 
	КонецЕсли;
	//Создаем Страницы
	ПеременнаяГруппаСтраницы = Элементы.Найти("ГруппаСтраниц");
	Если ПеременнаяГруппаСтраницы = Неопределено Тогда
		ГруппаСтраниц = ДФИ.СздГруппаСтраниц(ЭтотОбъект,"ГруппаСтраниц",ЭтотОбъект,1,1);
	КонецЕсли;
	СчетчикСтраниц = 1;
	НазваниеСтраницы = "Страница" + Строка(СчетчикСтраниц);
	Для каждого ЭлементМассива Из СтраницыИзХранилищаЗначений Цикл

		НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,ГруппаСтраниц,Объект.КомментарийРасположение,1,1);
		
		ДФИ.СоздатьКоманду(ЭтотОбъект,"ПриветИнфостарт","Проверка","СообщитьПриветИнфостарт");
		ДФИ.СздКнопка(ЭтотОбъект,"Проверка",НоваяСтраница,"Поздароваться","ПриветИнфостарт",2);
		СчетчикСтраниц = СчетчикСтраниц+1;
		НазваниеСтраницы = "Страница" + Строка(СчетчикСтраниц);
	КонецЦикла;
	
	
	Элементы.ПутьКФайлуСтраницы.Видимость= Ложь;
	//Элементы.СтраницаГлавная.Видимость = Ложь;
	Элементы.ДобавитьОисание.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПриветИнфостарт(Команда)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Привет Инфостарт!";
	Сообщение.Сообщить();
КонецПроцедуры
#КонецОбласти
