

#Область ОписаниеПеременных
 
Перем СтраницыИзХранилищаЗначений;
Перем СтраницыИзХранилищаЗначенийНаКлиенте;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//ДанныеХранилища = ПрочитатьПутьКФАйлуОписания();
//	Если ПутьКФайлуСтраницы = Неопределено Тогда
//		// Если нет ни одного выбранного файла, то програмно создаем СтраницЫ
//		// Определяем родительский элемент для страниц
//		ПеременнаяГруппаСтраницы = Элементы.Найти("Страницы");
//			Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   				ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   				ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//			КонецЕсли;
//
//		// Создаём новую страницу (вкладку)
//		Если Элементы.Найти("ГруппаСертификация") = Неопределено Тогда
//		    ПеременнаяГруппаСертификация = Элементы.Вставить("ГруппаСертификация", Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//		    ПеременнаяГруппаСертификация.Вид = ВидГруппыФормы.Страница;
//		    ПеременнаяГруппаСертификация.Заголовок = "Сертификация";
//		КонецЕсли;
//		ПутьКФайлуМассив = Новый Массив;
//		ПутьКФайлуМассив[0] = "жфжывдлоыва";
//		Элементы.ОписаниеХранилищеЗначений.Записать(ПутьКФайлуМассив);
//		
//	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьПутьКФАйлуОписания()
	Если ЗначениеЗаполнено(Объект.ОписаниеХранилищеЗначений) Тогда
		ДанныеХр = Объект.ОписаниеХранилищеЗначений.Получить();
		Возврат ДанныеХр;
	КонецЕсли; 
	Возврат Неопределено;
КонецФункции


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СтраницыИзХранилищаЗначений = ТекущийОбъект.ОписаниеХранилищеЗначений.Получить();
	Если СтраницыИзХранилищаЗначений = Неопределено Тогда
		СтраницыИзХранилищаЗначений = Новый Массив;
		СтраницаИзХЗ = Новый Структура ("КодСтраницы, НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.КодСтраницы = "";
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		Объект.КомментарийРасположение = "";
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначений.Добавить(СтраницаИзХЗ);
	КонецЕсли;
	УникальныйИдентификаторВладельца = Новый УникальныйИдентификатор();
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначений, УникальныйИдентификаторВладельца);
	ИзменитьФорму();  //Програмно добавляю вкладки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//СтраницыИзХранилищаЗначений = Неопределено;
	Если АдресДанныхВременногоХранилища <> Неопределено Тогда 
	
		ДанныеДляЗаписи = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
		Для  Индекс = 0 ПО ДанныеДляЗаписи.Вграница() Цикл
			МассивТекСтраница =  ДанныеДляЗаписи[индекс];
			КодСтраницы = "Страница" + Строка(Индекс);
			НазваниеТекста = "Текст" + Строка(Индекс);
			ТекСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Найти(КодСтраницы);
			ТекТекст = ТекСтраница.ПодчиненныеЭлементы.Найти(НазваниеТекста);
			Если ТекТекст <> Неопределено Тогда
				МассивТекСтраница.ТекстОписания = ЭтотОбъект[НазваниеТекста];
			КонецЕсли;
		КонецЦикла;
		
		ТекущийОбъект.ОписаниеХранилищеЗначений = Новый ХранилищеЗначения(ДанныеДляЗаписи);
	КонецЕсли;
	
//	ТОбъект = РеквизитФормыВЗначение("Объект");
//	ДанныеДляЗаписи = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
//	ТОбъект.ОписаниеХранилищеЗначений = Новый ХранилищеЗначения(ДанныеДляЗаписи);
//	//ТОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    СтраницыИзХранилищаЗначений = ЭтотОбъект.Параметры.Ключ.ОписаниеХранилищеЗначений.Получить();
	Если СтраницыИзХранилищаЗначений = Неопределено Тогда
//		СтраницыИзХранилищаЗначений = Новый Массив;
//		СтраницаИзХЗ = Новый Структура ("КодСтраницы, НазваниеСтраницы, ФайлОписания, ТекстОписания");
//		СтраницаИзХЗ.КодСтраницы = "";
//		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
//		Объект.КомментарийРасположение = "";
//		СтраницаИзХЗ.ФайлОписания = "";
//		СтраницаИзХЗ.ТекстОписания = "";
//		СтраницыИзХранилищаЗначений.Добавить(СтраницаИзХЗ);
	КонецЕсли;
	УникальныйИдентификаторВладельца = Новый УникальныйИдентификатор();
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначений, УникальныйИдентификаторВладельца);
	ИзменитьФорму();  //Програмно добавляю вкладки

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл прайс листа";
	ВыбранныйФильтр = "Документ Word (.doc)|*.doc?"; 
	Проводник.Фильтр = ВыбранныйФильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	Если объект.ОписаниеХранилищеЗначений <> "" Тогда
		СтандартнаяОбработка = Ложь;  // не выводит стандартное окно оповещения  
		ЗапуститьПриложение (Объект.ПутьКФайлу);
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура КомментарийРасположениеПриИзменении(Элемент)
	Если Объект.КомментарийРасположение = "" Тогда
		Элементы.ДобавитьОписание.Доступность = Ложь;
	Иначе 
		Элементы.ДобавитьОписание.Доступность = Истина;
	КОнецЕсли 
	//КомментарийРасположениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРасположениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ДобавитьОписание.Доступность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧОписание
&НаКлиенте
Процедура ТЧОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТЧОписаниеПутьКФайлуОписания" Тогда
        СтандартнаяОбработка = Ложь; // Отменяем стандартное поведение
        
        // Получаем данные текущей строки
        ТекДанные = Элементы.ТЧОписание.ТекущиеДанные;
        Если ТекДанные <> Неопределено Тогда
            // Здесь можно реализовать код для открытия файла по пути, хранящемуся в данных строки
            ЗапуститьПриложение(ТекДанные.СсылкаНаОписание); // Пример: использование функции ЗапуститьПриложение
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьОисание(Команда)
	Элементы.ДобавитьОписание.Доступность = Ложь;
	Если АдресДанныхВременногоХранилища <> "" Тогда
		СтраницыИзХранилищаЗначенийНаКлиенте = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	КонецЕсли;
	Если СтраницыИзХранилищаЗначенийНаКлиенте = Неопределено Тогда
		// Создаем первый элемнте массива (первую страницу)
		СтраницыИзХранилищаЗначенийНаКлиенте = Новый Массив;
		СтраницаИзХЗ = Новый Структура ("КодСтраницы, НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.КодСтраницы = "";
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		Объект.КомментарийРасположение = "";
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначенийНаКлиенте.Добавить(СтраницаИзХЗ);
	Иначе
		СтраницаИзХЗ = Новый Структура ("КодСтраницы,НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.КодСтраницы = "";
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		Объект.КомментарийРасположение = "";
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначенийНаКлиенте.Добавить(СтраницаИзХЗ); 
	КонецЕсли;
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
		//ДобавитьСтраницу();
	ИзменитьФорму();
		//НазваниеСтраницы = Объект.стра
		//НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,ГруппаСтраниц,Объект.КомментарийРасположение,1,1);
		//ДФИ.СоздатьКоманду(ЭтотОбъект,"ПриветИнфостарт","Проверка","СообщитьПриветИнфостарт");
		//ДФИ.СздКнопка(ЭтотОбъект,"Проверка",НоваяСтраница,"Поздароваться","ПриветИнфостарт",2);
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт
	
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Файл для загрузки не выбран");
		Объект.ПутьКФайлуСтраницы = "";
		Возврат;
	КонецЕсли;
	//
	Контейнер = Элементы.ГруппаСтраниц; //.Страницы.Найти("ИмяВерсии");
	НазваниеТекущейСтраницы = Элементы.группаСтраниц.ТекущаяСтраница.Имя;
	Страница = Контейнер.ПодчиненныеЭлементы.Найти(НазваниеТекущейСтраницы);
	
	Если АдресДанныхВременногоХранилища <> "" Тогда
		СтраницыИзХранилищаЗначенийНаКлиенте = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	КонецЕсли;
	//Вставляем путь к файлу в поле формы
	Для каждого ЭлементМассива из СтраницыИзХранилищаЗначенийНаКлиенте Цикл
		Если Страница.Имя = ЭлементМассива.Кодстраницы Тогда
			ЭлементМассива.ФайлОписания = ВыбранныеФайлы[0];
			ЦифрыИзНазвания = МоиВспомогательные.ПолучитьТолькоЦифрыИзСтроки(Страница.Имя);
			НазваниеПоляСтраницы = "ПутьФайла"+ Строка(ЦифрыИзНазвания);
			//Страница.ПодчиненныеЭлементы[НазваниеПоляСтраницы] = ВыбранныеФайлы[0];
			ЭтотОбъект[НазваниеПоляСтраницы]= ВыбранныеФайлы[0];
		КонецЕсли
	КонецЦикла;
	ПутьКФайлуСтраницы = ВыбранныеФайлы[0];
	//ТекстИЗФайла = МоиВспомогательные.ПрочитатьТекстИзDocx(ВыбранныеФайлы[0]);
	
	
	// Комментарий из вордовских файлов
	ДвоичныеДанныеФайла = Новый ДвоичныеДанные(ЭтотОбъект[НазваниеПоляСтраницы]); 
	ТекстИзФайла = МоиВспомогательные.ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла);
	
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
КонецПроцедуры







&НаКлиенте
Процедура ДобавитьСтраницу()
	НазваниеСтараницы = "Страница";// + Строка(СтраницыИзХранилищаЗначений.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормуНаКлиенте(АдресДанных)
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьФорму()

	СтраницыИзХранилищаЗначений = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	Если СтраницыИзХранилищаЗначений = Неопределено Тогда
		// Если в массиве нет ни одногй страницы
		
	Иначе
		//Если массив страниц существует
		//Создаем ГруппуСтраниц
		ПеременнаяГруппаСтраницы = Элементы.Найти("ГруппаСтраниц");
		Если ПеременнаяГруппаСтраницы = Неопределено Тогда
			ГруппаСтраниц = ДФИ.СздГруппаСтраниц(ЭтотОбъект,"ГруппаСтраниц",ЭтотОбъект,1,1);
			ГруппаСтраниц.РастягиватьПоГоризонтали = Истина;
			//Создаем страницы Массива в первый раз при открытии
			Для  Индекс = 0 ПО СтраницыИзХранилищаЗначений.Количество()-1 Цикл
				ЭлементМассива = СтраницыИзХранилищаЗначений[Индекс];
				
				//Создаем страницы
				КодСтраницы = "Страница" + Строка(Индекс);
				ТекущийЗаголовок = ЭлементМассива.НазваниеСтраницы;
				ЭлементМассива.КодСтраницы = КодСтраницы;
				НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,КодСтраницы,ГруппаСтраниц,ТекущийЗаголовок,1,1);
				
				//Создаем группу для поля  - Путь к файлу  и кнопке - Удалить страницу
				НазваниеГруппыДляКнопки = "ГруппаДляКнопки"  + Строка(Индекс);
				ГруппаДляКнопки = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,НазваниеГруппыДляКнопки,КодСтраницы,1);
				ГруппаДляКнопки.РастягиватьПоГоризонтали = Истина;
				ГруппаДляКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
				
				//Создаем Поле и команду в группе
				НазваниеПутиФайла = "ПутьФайла" + Строка(Индекс);
				стрРеквизитов = Новый Структура;
				стрРеквизитов.Вставить(НазваниеПутиФайла,ДФИ.ОписаниеТипаСтрока());
				ДФИ.СоздатьРеквизиты(ЭтотОбъект,стрРеквизитов);
				СобытияПоля = Новый Структура;
				СобытияПоля.Вставить("НачалоВыбора","ПутьКФайлуНачалоВыбора");
				ПолеПутиФайла = ДФИ.СздПоле(ЭтотОбъект,НазваниеПутиФайла,ГруппаДляКнопки,,1,НазваниеПутиФайла,,СобытияПоля);
				ЭтотОбъект[НазваниеПутиФайла] = ЭлементМассива.ФайлОписания;
				ПолеПутиФайла.кнопкаВыбора = Истина;
				ПолеПутиФайла.кнопкаОчистки = Истина;
				ПолеПутиФайла.кнопкаОткрытия = Истина;
				
				//Создаем Кнопку - "Удалитьстраницу"
				НазваниеКоманды = "Команда" + Строка(Индекс);	
				НазваниеКнопки = "Кнопка" + Строка(Индекс);
				ДФИ.СоздатьКоманду(ЭтотОбъект,НазваниеКоманды,"Проверка","УдалитьСтраницу");
				СвойстваКнопки = Новый Структура;
				СвойстваКнопки.Вставить("ГоризонтальноеПоложениеВГруппе",ГоризонтальноеПоложениеЭлемента.Право);  
				НоваяКнопка = ДФИ.СздКнопка(ЭтотОбъект,НазваниеКнопки,ГруппаДляКнопки,"Удалить страницу с описанием",НазваниеКоманды,2,СвойстваКнопки);
							
				//Создаем поле для Текста описания
				НазваниеТекста = "Текст" + Строка(Индекс);
				стрРеквизитов = Новый Структура;
				стрРеквизитов.Вставить(НазваниеТекста,ДФИ.ОписаниеТипаСтрока());
				ДФИ.СоздатьРеквизиты(ЭтотОбъект,стрРеквизитов);
				НовоеПоле = ДФИ.СздПоле(ЭтотОбъект,НазваниеТекста,КодСтраницы,,1,НазваниеТекста);
				НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовоеПоле.Ширина = 150;
				НовоеПоле.МногострочныйРежим = Истина;
				НовоеПоле.РастягиватьПоГоризонтали = Истина;		
				НовоеПоле.РастягиватьПоВертикали = Истина;
				ЭтотОбъект[НазваниеТекста] = ЭлементМассива.ТекстОписания;

								
			КонецЦикла;
		Иначе
			
			//Добавляем страницу к существующим
			ИндексПоследнегоЭлемента = СтраницыИзХранилищаЗначений.ВГраница();
			ПоследнийЭлементМассива = СтраницыИзХранилищаЗначений[ИндексПоследнегоЭлемента];
			Если ИндексПоследнегоЭлемента = 0 Тогда  // Если элементов в массиве 1
				Индекс = 0;
			Иначе
				ПредПоследнийЭлементМассива = СтраницыИзХранилищаЗначений[ИндексПоследнегоЭлемента-1];
				ЦифрыИзНазванияПоследнегоЭлемента = МоиВспомогательные.ПолучитьТолькоЦифрыИзСтроки(ПредПоследнийЭлементМассива.КодСтраницы);
				Индекс = Число(ЦифрыИзНазванияПоследнегоЭлемента)+1;
			КонецЕсли;
			КодСтраницы = "Страница" + Строка(Индекс);
			
			// Проверяем на наличие страницы с таким названием
			СтараяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Найти(КодСтраницы);
			Если СтараяСтраница = Неопределено Тогда
				ПоследнийЭлементМассива.КодСтраницы = КодСтраницы;
				НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,КодСтраницы,"ГруппаСтраниц",ПоследнийЭлементМассива.НазваниеСтраницы,1,1);
				
				//Создаем группу для поля  - Путь к файлу  и кнопке - Удалить страницу
				НазваниеГруппыДляКнопки = "ГруппаДляКнопки"  + Строка(Индекс);
				ГруппаДляКнопки = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,НазваниеГруппыДляКнопки,КодСтраницы,1);
				ГруппаДляКнопки.РастягиватьПоГоризонтали = Истина;
				ГруппаДляКнопки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
								
				//Создаем Поле и команду в группе
				НазваниеПутиФайла = "ПутьФайла" + Строка(Индекс);
				стрРеквизитов = Новый Структура;
				стрРеквизитов.Вставить(НазваниеПутиФайла,ДФИ.ОписаниеТипаСтрока());
				ДФИ.СоздатьРеквизиты(ЭтотОбъект,стрРеквизитов);
				СобытияПоля = Новый Структура;
				СобытияПоля.Вставить("НачалоВыбора","ПутьКФайлуНачалоВыбора");
				ПолеПутиФайла = ДФИ.СздПоле(ЭтотОбъект,НазваниеПутиФайла,ГруппаДляКнопки,,1,НазваниеПутиФайла,,СобытияПоля);
				ЭтотОбъект[НазваниеПутиФайла] = ""; //ЭлементМассива.ФайлОписания;
				ПолеПутиФайла.кнопкаВыбора = Истина;
				ПолеПутиФайла.кнопкаОчистки = Истина;
				ПолеПутиФайла.кнопкаОткрытия = Истина;
				
				НазваниеКоманды = "Команда" + Строка(Индекс);
				ДФИ.СоздатьКоманду(ЭтотОбъект,НазваниеКоманды,"Проверка","УдалитьСтраницу");
				
				НазваниеКнопки = "Кнопка" + Строка(Индекс);
				СвойстваКнопки = Новый Структура;
				СвойстваКнопки.Вставить("ГоризонтальноеПоложениеВГруппе",ГоризонтальноеПоложениеЭлемента.Право);
				ДФИ.СздКнопка(ЭтотОбъект,НазваниеКнопки,ГруппаДляКнопки,"Удалить страницу с описанием",НазваниеКоманды,2,СвойстваКнопки);
				
				НазваниеТекста = "Текст" + Строка(Индекс);
				стрРеквизитов = Новый Структура;
				стрРеквизитов.Вставить(НазваниеТекста,ДФИ.ОписаниеТипаСтрока());
				ДФИ.СоздатьРеквизиты(ЭтотОбъект,стрРеквизитов);
				НовоеПоле = ДФИ.СздПоле(ЭтотОбъект,НазваниеТекста,КодСтраницы,,1,НазваниеТекста);
				НовоеПоле.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
				НовоеПоле.Ширина = 150;
				НовоеПоле.МногострочныйРежим = Истина;
				НовоеПоле.РастягиватьПоГоризонтали = Истина;		
				НовоеПоле.РастягиватьПоВертикали = Истина;
				
				Элементы.ГруппаСтраниц.ТекущаяСтраница = НоваяСтраница;
			Иначе  // Есть страница с таким же названием
				ПоследнийЭлементМассива.КодСтраницы = КодСтраницы;
				СтараяСтраница.Заголовок = ПоследнийЭлементМассива.НазваниеСтраницы;
				СтараяСтраница.Видимость = Истина;
				//СтараяСтраница.Имя = КодСтраницы;
				Элементы.ГруппаСтраниц.ТекущаяСтраница = СтараяСтраница;
			КонецЕсли
		КонецЕсли
	КонецЕсли;
	Элементы.ДобавитьОписание.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтраницу(Команда)
	
	// Сначала находим группу-контейнер
	Контейнер = Элементы.ГруппаСтраниц; //.Страницы.Найти("ИмяВерсии");
	НазваниеТекущейСтраницы = Элементы.группаСтраниц.ТекущаяСтраница.Имя;
	Страница = Контейнер.ПодчиненныеЭлементы.Найти(НазваниеТекущейСтраницы);
	СтраницыИзХранилищаЗначенийНаКлиенте = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	Если Страница <> Неопределено Тогда
    	//Элементы.Удалить(Страница); // Ошибка  - Изменениесоставов Элементов недоступно
    	Страница.Видимость = Ложь;
    КонецЕсли;
	
	
	Для Индекс = 0 по СтраницыИзХранилищаЗначенийНаКлиенте.Вграница() Цикл
		ЭлементМассива = СтраницыИзХранилищаЗначенийНаКлиенте[Индекс];
		Если ЭлементМассива.КодСтраницы = НазваниеТекущейСтраницы Тогда
			
			Если СтраницыИзХранилищаЗначенийНаКлиенте.Количество() = 1 Тогда
				// Если всего одна страница, то удаляем элемент и ничего больше не делаем
				СтраницыИзХранилищаЗначенийНаКлиенте.Удалить(Индекс);
				Прервать;
			ИначеЕсли Индекс >= 0 И Индекс < СтраницыИзХранилищаЗначенийНаКлиенте.ВГраница() Тогда
				// Делаем активной следующую страницу 
				СтраницыИзХранилищаЗначенийНаКлиенте.Удалить(Индекс);
				МассивТекСтраница = СтраницыИзХранилищаЗначенийНаКлиенте[индекс];
				ИмяНовойТекСтраницы = МассивТекСтраница.КодСтраницы;
				НоваяТекСтраница = Контейнер.ПодчиненныеЭлементы.Найти(ИмяНовойТекСтраницы);
				Контейнер.ТекущаяСтраница = НоваяТекСтраница;
				Прервать;
			ИначеЕсли СтраницыИзХранилищаЗначенийНаКлиенте.ВГраница() = индекс  Тогда
				СтраницыИзХранилищаЗначенийНаКлиенте.Удалить(Индекс);
				МассивТекСтраница = СтраницыИзХранилищаЗначенийНаКлиенте[индекс-1];
				ИмяНовойТекСтраницы = МассивТекСтраница.КодСтраницы;
				НоваяТекСтраница = Контейнер.ПодчиненныеЭлементы.Найти(ИмяНовойТекСтраницы);
				Контейнер.ТекущаяСтраница = НоваяТекСтраница;
				Прервать;
			КонецЕсли;
			
			
			Прервать;
			//СледующаяСтраница = Контейнер.ПодчиненныеЭлементы.Найти(ЭлементМассива.НазваниеСтраницы); 
			//Контейнер.текущаяСтраницы = 	
		КонецЕсли;
	КонецЦикла;
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
	
//	УдалитьЭлементНаСервере();   // Не работает
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура УдалитьЭлементНаСервере()
	ДФИ.УдлРеквизитИЭлемент(ЭтотОбъект,"Страница2");
КонецПроцедуры


