
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПутьКФайлуОписанияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл прайс листа";
	ВыбранныйФильтр = "Таблица XLS/XLSX (.xls)|*.xls?"; 
	Проводник.Фильтр = ВыбранныйФильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОписанияОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОписанияОткрытие(Элемент, СтандартнаяОбработка)
	Если объект.ПутьКФайлуОписания <> "" Тогда
		СтандартнаяОбработка = Ложь;  // не выводит стандартное окно оповещения  
		ЗапуститьПриложение (Объект.ПутьКФайлуОписания);
	КонецЕсли
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧОписание
&НаКлиенте
Процедура ТЧОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТЧОписаниеПутьКФайлуОписания" Тогда
        СтандартнаяОбработка = Ложь; // Отменяем стандартное поведение
        
        // Получаем данные текущей строки
        ТекДанные = Элементы.ТЧОписание.ТекущиеДанные;
        Если ТекДанные <> Неопределено Тогда
            // Здесь можно реализовать код для открытия файла по пути, хранящемуся в данных строки
            ЗапуститьПриложение(ТекДанные.СсылкаНаОписание); // Пример: использование функции ЗапуститьПриложение
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт 
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Файл для загрузки не выбран");
		Объект.ПутьКФайлу = "";
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлуОписания = ВыбранныеФайлы[0];
КонецПроцедуры


#КонецОбласти
