

#Область ОписаниеПеременных
 
Перем СтраницыИзХранилищаЗначений;
Перем СтраницыИзХранилищаЗначенийНаКлиенте;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	//ДанныеХранилища = ПрочитатьПутьКФАйлуОписания();
//	Если ПутьКФайлуСтраницы = Неопределено Тогда
//		// Если нет ни одного выбранного файла, то програмно создаем СтраницЫ
//		// Определяем родительский элемент для страниц
//		ПеременнаяГруппаСтраницы = Элементы.Найти("Страницы");
//			Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   				ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   				ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//			КонецЕсли;
//
//		// Создаём новую страницу (вкладку)
//		Если Элементы.Найти("ГруппаСертификация") = Неопределено Тогда
//		    ПеременнаяГруппаСертификация = Элементы.Вставить("ГруппаСертификация", Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//		    ПеременнаяГруппаСертификация.Вид = ВидГруппыФормы.Страница;
//		    ПеременнаяГруппаСертификация.Заголовок = "Сертификация";
//		КонецЕсли;
//		ПутьКФайлуМассив = Новый Массив;
//		ПутьКФайлуМассив[0] = "жфжывдлоыва";
//		Элементы.ОписаниеХранилищеЗначений.Записать(ПутьКФайлуМассив);
//		
//	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПрочитатьПутьКФАйлуОписания()
	Если ЗначениеЗаполнено(Объект.ОписаниеХранилищеЗначений) Тогда
		ДанныеХр = Объект.ОписаниеХранилищеЗначений.Получить();
		Возврат ДанныеХр;
	КонецЕсли; 
	Возврат Неопределено;
КонецФункции


//  
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СтраницыИзХранилищаЗначений = ТекущийОбъект.ОписаниеХранилищеЗначений.Получить();
	УникальныйИдентификаторВладельца = Новый УникальныйИдентификатор();
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначений, УникальныйИдентификаторВладельца);
	ИзменитьФорму();  //Програмно добавляю вкладки
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//СтраницыИзХранилищаЗначений = Неопределено;
	Если АдресДанныхВременногоХранилища <> Неопределено Тогда 
		ДанныеДляЗаписи = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
		ТекущийОбъект.ОписаниеХранилищеЗначений = Новый ХранилищеЗначения(ДанныеДляЗаписи);
	КонецЕсли
	
//	ТОбъект = РеквизитФормыВЗначение("Объект");
//	ДанныеДляЗаписи = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
//	ТОбъект.ОписаниеХранилищеЗначений = Новый ХранилищеЗначения(ДанныеДляЗаписи);
//	//ТОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    //СтраницыИзХранилищаЗначений = Новый Массив;

КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Проводник.Заголовок = "Выберите файл прайс листа";
	ВыбранныйФильтр = "Документ Word (.doc)|*.doc?"; 
	Проводник.Фильтр = ВыбранныйФильтр;
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	Проводник.Показать(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытиеМножественногоЗначения(Элемент, Идентификатор, СтандартнаяОбработка)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуОткрытие(Элемент, СтандартнаяОбработка)
	Если объект.ОписаниеХранилищеЗначений <> "" Тогда
		СтандартнаяОбработка = Ложь;  // не выводит стандартное окно оповещения  
		ЗапуститьПриложение (Объект.ПутьКФайлу);
	КонецЕсли
КонецПроцедуры


&НаКлиенте
Процедура КомментарийРасположениеПриИзменении(Элемент)
	Если Объект.КомментарийРасположение = "" Тогда
		Элементы.ДобавитьОисание.Доступность = Ложь;
	Иначе 
		Элементы.ДобавитьОисание.Доступность = Истина;
	КОнецЕсли 
	//КомментарийРасположениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРасположениеИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	Элементы.ДобавитьОисание.Доступность = Истина;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧОписание
&НаКлиенте
Процедура ТЧОписаниеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТЧОписаниеПутьКФайлуОписания" Тогда
        СтандартнаяОбработка = Ложь; // Отменяем стандартное поведение
        
        // Получаем данные текущей строки
        ТекДанные = Элементы.ТЧОписание.ТекущиеДанные;
        Если ТекДанные <> Неопределено Тогда
            // Здесь можно реализовать код для открытия файла по пути, хранящемуся в данных строки
            ЗапуститьПриложение(ТекДанные.СсылкаНаОписание); // Пример: использование функции ЗапуститьПриложение
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ДобавитьОисание(Команда)
	Элементы.ДобавитьОисание.Доступность = Ложь;
	Если АдресДанныхВременногоХранилища <> "" Тогда
		СтраницыИзХранилищаЗначенийНаКлиенте = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	КонецЕсли;
	Если СтраницыИзХранилищаЗначенийНаКлиенте = Неопределено Тогда
		СтраницыИзХранилищаЗначенийНаКлиенте = Новый Массив;
		СтраницаИзХЗ = Новый Структура ("КодСтраницы, НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.КодСтраницы = "";
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначенийНаКлиенте.Добавить(СтраницаИзХЗ);
	Иначе
		СтраницаИзХЗ = Новый Структура ("КодСтраницы,НазваниеСтраницы, ФайлОписания, ТекстОписания");
		СтраницаИзХЗ.КодСтраницы = "";
		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
		СтраницаИзХЗ.ФайлОписания = "";
		СтраницаИзХЗ.ТекстОписания = "";
		СтраницыИзХранилищаЗначенийНаКлиенте.Добавить(СтраницаИзХЗ); 
	КонецЕсли;
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
		//ДобавитьСтраницу();
	ИзменитьФорму();
		//НазваниеСтраницы = Объект.стра
		//НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,ГруппаСтраниц,Объект.КомментарийРасположение,1,1);
		//ДФИ.СоздатьКоманду(ЭтотОбъект,"ПриветИнфостарт","Проверка","СообщитьПриветИнфостарт");
		//ДФИ.СздКнопка(ЭтотОбъект,"Проверка",НоваяСтраница,"Поздароваться","ПриветИнфостарт",2);
КонецПроцедуры
#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеВыбораФайла (ВыбранныеФайлы, ДополнительныеПараметры)Экспорт 
	ОчиститьСообщения();
	Если ВыбранныеФайлы = Неопределено Тогда
		Сообщить("Файл для загрузки не выбран");
		Объект.ПутьКФайлуСтраницы = "";
		Возврат;
	КонецЕсли;
	ПутьКФайлуСтраницы = ВыбранныеФайлы[0];
	//ДвоичныеДанныеФайла = Новый ДвоичныеДанные(Объект.ПутьКФайлуСтраницы); 
	
	//ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла);
КонецПроцедуры

//Конвертирует в zip документ docx и читает файл comments.xml из разархивированной папки
//
// Параметры:
//  ДвоичныеДанныеФайла	 - Двоичные данные - Двоичные данные файла Word, который необходимо прочитать
// 
// Возвращаемое значение:
// Строка - Все примечания, которые есть в документе строкой 
//
Функция ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла)
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
	КопироватьФайл(ПутьКФайлу, СтрЗаменить(ПутьКФайлу, "docx", "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(ПутьКФайлу, "docx", "zip");
	
	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	
	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть(); 
	
	//В этом отдельном файле хранятся примечания скопом
	Файл = Новый Файл(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		
	СтрокаПримечания = "";	
	//Если Файл.Существует() Тогда		
		//СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/document.xml");
			
	//КонецЕсли;
			
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ПутьКФайлу);
	УдалитьФайлы(ИмяФайлаСПутемZIP);
	
	Возврат СтрокаПримечания;
	
КонецФункции

//Ищет теги примечания и берет текстовое значение в указанном файле.Учитываются комментарии только начинающиеся со знака "#"
//
// Параметры:
//  ПутьКФайлуСтраницы	 - 	Строка  - Путь к xml файлу, который нужно прочитать
// 
// Возвращаемое значение:
// Строка  - прочитанные значения (текст примечаний через перенос строки)
//
Функция XMLComments(ПутьКФайлу)
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(ПутьКФайлу);
	
	МассивПримечания = Новый Массив;
	
	НачалсяКомментарий = Ложь;
	Пока Файл.Прочитать() Цикл			
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Истина;
			СтрокаПримечаний = "";
			Продолжить;
		КонецЕсли;
		
		Если НачалсяКомментарий И Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрокаПримечаний = СтрокаПримечаний + Файл.Значение;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Ложь;
			МассивПримечания.Добавить(СтрокаПримечаний);
		КонецЕсли;		
	КонецЦикла;
	
	Файл.Закрыть();
	
	Сообщить("Привет" + СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС));
			
	Возврат СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС);

КонецФункции

&НаКлиенте
Процедура ДобавитьСтраницу()
	НазваниеСтараницы = "Страница";// + Строка(СтраницыИзХранилищаЗначений.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьФормуНаКлиенте(АдресДанных)
	
КонецПроцедуры


&НаСервере
Процедура ИзменитьФорму()
	//Если ПутьКФайлуСтраницы = Неопределено Тогда
		
	//Иначе
//		ПеременнаяГруппаСтраницы = Элементы.Найти("СтраницаГлавная");
//			Если ПеременнаяГруппаСтраницы = Неопределено Тогда
//   				ПеременнаяГруппаСтраницы = Элементы.Добавить("Страницы", Тип("ГруппаФормы"));
//   				ПеременнаяГруппаСтраницы.Вид = ВидГруппыФормы.Страницы;
//			КонецЕсли;
//		Для Индекс = 2 По 5 Цикл
//		// Создаём новую страницу (вкладку)
//		//Если Элементы.Найти("ГруппаСертификация") = Неопределено Тогда
//			НазваниеНадписи = "Надпись"+Строка(Индекс);
//			НазваниеСтраницы = "Страница"+Строка(Индекс);
//			НазваниеКоманды = "Команда"+Строка(Индекс);
//		    НоваяСтраница = Элементы.Вставить(НазваниеСтраницы, Тип("ГруппаФормы"), ПеременнаяГруппаСтраницы);
//		    НоваяСтраница.Вид = ВидГруппыФормы.Страница;
//		    НоваяСтраница.Заголовок = "Сертификация";
//		    НовыйЭлемент2 = Элементы.Добавить(НазваниеНадписи,Тип("ДекорацияФормы"), НоваяСтраница);
//    		НовыйЭлемент2.Заголовок = "НоваяНадпись"+Строка(Индекс);
//    		НовыйЭлемент3 = Команды.Добавить(НазваниеКоманды);
//    		НовыйЭлемент3.Заголовок = "Удалить";
//    		НовыйЭлемент3.Действие = "УдалитьСтраницу"
//    	КонецЦикла;
//		//КонецЕсли;

//		ГруппаШапка = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект, "ГруппаШапка",ЭтотОбъект,3,1);
//		ГруппаШапкаЛево = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,"ГруппаШапкаЛево",ГруппаШапка,1); 
//		ГруппаШапкаПраво = ДФИ.СздГруппаОбычнаяБезОтображения(ЭтотОбъект,"ГруппаШапкаПраво",ГруппаШапка,1);
	//СтраницыИзХранилищаЗначений = ЭтотОбъект.ОписаниеХранилищеЗначений.Получить();
	
	СтраницыИзХранилищаЗначений = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	Если СтраницыИзХранилищаЗначений = Неопределено Тогда
		// Если в массиве нет ни одногй страницы
		
//		СтраницыИзХранилищаЗначений = Новый Массив;
//		СтраницаИзХЗ = Новый Структура ("НазваниеСтраницы, ФайлОписания, ТекстОписания");
//		СтраницаИзХЗ.НазваниеСтраницы = Объект.КомментарийРасположение;
//		СтраницаИзХЗ.ФайлОписания = "";
//		СтраницаИзХЗ.ТекстОписания = "";
//		СтраницыИзХранилищаЗначений.Добавить(СтраницаИзХЗ);
	Иначе
		//Если массив страниц существует
		//Создаем ГруппуСтраниц
		ПеременнаяГруппаСтраницы = Элементы.Найти("ГруппаСтраниц");
		Если ПеременнаяГруппаСтраницы = Неопределено Тогда
			ГруппаСтраниц = ДФИ.СздГруппаСтраниц(ЭтотОбъект,"ГруппаСтраниц",ЭтотОбъект,1,1);
			//Создаем страницы Массива в первый раз при открытии
			СчетчикКоманд = 1;
			НазваниеКоманды = "Команда" + Строка(СчетчикКоманд);
			СчетчикКнопки = 1;
			НазваниеКнопки = "Кнопка" + Строка(СчетчикКнопки);
			СчетчикСтраниц = 1;
			НазваниеСтраницы = "Страница" + Строка(СчетчикСтраниц);
			Для каждого ЭлементМассива Из СтраницыИзХранилищаЗначений Цикл
				//ЗаголовокСтраницы = СтраницыИзХранилищаЗначений[ЭлементМассива];
				ТекущийЗаголовок = ЭлементМассива.НазваниеСтраницы;
				ЭлементМассива.КодСтраницы = НазваниеСтраницы;
				НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,ГруппаСтраниц,ТекущийЗаголовок,1,1);
				
				ДФИ.СоздатьКоманду(ЭтотОбъект,НазваниеКоманды,"Проверка","СообщитьПриветИнфостарт");
				ДФИ.СздКнопка(ЭтотОбъект,НазваниеКнопки,НазваниеСтраницы,"Удалить",НазваниеКоманды,2);
				//Сообщить("Привет"); 
				СчетчикСтраниц = СчетчикСтраниц + 1;
				СчетчикКоманд = СчетчикКоманд + 1;
				СчетчикКнопки = СчетчикКнопки + 1;
				НазваниеСтраницы = "Страница" + Строка(СчетчикСтраниц);
				НазваниеКоманды = "Команда" + Строка(СчетчикКоманд);
				НазваниеКнопки = "Кнопка" + Строка(СчетчикКнопки);
			КонецЦикла;
		Иначе
			
			//Добавляем страницу к существующим
			ИндексПоследнегоЭлемента = СтраницыИзХранилищаЗначений.ВГраница()-1;
			ПоследнийЭлементМассива = СтраницыИзХранилищаЗначений[ИндексПоследнегоЭлемента];
			ЦифрыИзНазванияПоследнегоЭлемента = МоиВспомогательные.ПолучитьТолькоЦифрыИзСтроки(ПоследнийЭлементМассива.КодСтраницы);
			//СчетчикСтраниц = СтраницыИзХранилищаЗначений.Количество();
			СчетчикКоманд = СтраницыИзХранилищаЗначений.Количество();
			СчетчикКнопки = СтраницыИзХранилищаЗначений.Количество();
			НазваниеСтраницы = "Страница" + Строка(ЦифрыИзНазванияПоследнегоЭлемента + 1);
			НазваниеКоманды = "Команда" + Строка(СчетчикКоманд);
			НазваниеКнопки = "Кнопка" + Строка(СчетчикКнопки); 
			
			НоваяСтраница = ДФИ.СздСтраница(ЭтотОбъект,НазваниеСтраницы,"ГруппаСтраниц",Объект.КомментарийРасположение,1,1);
				
			ДФИ.СоздатьКоманду(ЭтотОбъект,НазваниеКоманды,"Проверка","СообщитьПриветИнфостарт");
			ДФИ.СздКнопка(ЭтотОбъект,НазваниеКнопки,НазваниеСтраницы,"Удалить",НазваниеКоманды,2);
		КонецЕсли
	КонецЕсли;
	//АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
	
	
	
	
	
	
	
	
	Элементы.ПутьКФайлуСтраницы.Видимость= Ложь;
	//Элементы.СтраницаГлавная.Видимость = Ложь;
	Элементы.ДобавитьОисание.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщитьПриветИнфостарт(Команда)
//	Сообщение = Новый СообщениеПользователю;
//	Сообщение.Текст = "Привет Инфостарт!";
//	Сообщение.Сообщить();
	//ТекущаяСтраница = Элементы.ГруппаСтраниц.найти;
	//Элементы.Удалить(ТекущаяСтраница);
	
	// Сначала находим группу-контейнер
	Контейнер = Элементы.ГруппаСтраниц; //.Страницы.Найти("ИмяВерсии");
	НазваниеТекущейСтраницы = Элементы.группаСтраниц.ТекущаяСтраница.Имя;
	Страница = Контейнер.ПодчиненныеЭлементы.Найти(НазваниеТекущейСтраницы);
	СтраницыИзХранилищаЗначенийНаКлиенте = ПолучитьИзВременногоХранилища(АдресДанныхВременногоХранилища);
	Если Страница <> Неопределено Тогда
    	//Элементы.Удалить(Страница); // Ошибка  - Изменениесоставов Элементов недоступно
    	Страница.Видимость = Ложь;
    КонецЕсли;
	
	Индекс = 1;
	Для Каждого ЭлементМассива из СтраницыИзХранилищаЗначенийНаКлиенте Цикл
		Если ЭлементМассива.КодСтраницы = НазваниеТекущейСтраницы Тогда
			СтраницыИзХранилищаЗначенийНаКлиенте.Удалить(Индекс);	
		КонецЕсли;
		Индекс = Индекс+1;
	КонецЦикла;
	АдресДанныхВременногоХранилища = ПоместитьВоВременноеХранилище(СтраницыИзХранилищаЗначенийНаКлиенте, АдресДанныхВременногоХранилища);
	
//	УдалитьЭлементНаСервере();   // Не работает
	
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура УдалитьЭлементНаСервере()
	ДФИ.УдлРеквизитИЭлемент(ЭтотОбъект,"Страница2");
КонецПроцедуры


