
#Область ПрограммныйИнтерфейс

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
//
// Параметры:
//  КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//  Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//  ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	//Контактная информация справочника "Контактные лица"
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенногоВида = "СправочникКлиенты";
	Элемент.ЭтоГруппа = Истина;
	Элемент.Используется = Истина;
	Элемент.Наименование = НСтр("ru = 'Контактная иформация справочника ""Клиенты""'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	//Телефон контактного лица
	Элемент = Элементы.Добавить();
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
	Элемент.ИмяПредопределенногоВида = "ТелефонКлиента";
	Элемент.ИдентификаторДляФормул =  "ТелефонКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Используется = Истина;
	Элемент.Наименование = НСтр("ru = 'Телефон'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	//Адрес эл. почты клиента
	Элемент = Элементы.Добавить();
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	Элемент.ИмяПредопределенногоВида = "АдресЭлектроннойПочтыКлиента";
	Элемент.ИдентификаторДляФормул =  "АдресЭлектроннойПочтыКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Используется = Истина;
	Элемент.Наименование = НСтр("ru = 'Адрес электронной почты'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	//Телеграмм клиента
	Элемент = Элементы.Добавить();
	Элемент.Родитель = "СправочникКлиенты";
	Элемент.ИмяГруппы = "СправочникКлиенты";
	Элемент.Тип = Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	Элемент.ИмяПредопределенногоВида = "ТелеграммКлиента";
	Элемент.ИдентификаторДляФормул =  "ТелеграммКлиента";
	Элемент.ВидРедактирования = "ПолеВвода";
	Элемент.ОтображатьВсегда = Истина;
	Элемент.Используется = Истина;
	Элемент.Наименование = НСтр("ru = 'Телеграмм'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
