
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить только цифры из строки.
// 
// Параметры:
//  ВходнаяСтрока Входная строка из которой будут выбраны числа.
// 
// Возвращаемое значение:
//  Строка - Получить только цифры из строки
Функция ПолучитьТолькоЦифрыИзСтроки(ВходнаяСтрока) Экспорт
    СтрокаЦифр = ""; // Инициализируем пустую строку для результата
    ДлинаСтроки = СтрДлина(ВходнаяСтрока);
    Для НомерСимвола  = 1 ПО ДлинаСтроки Цикл
        Попытка
        	Символ = Сред(ВходнаяСтрока, НомерСимвола, 1);
            ЧислоИзСимвола = Число(Символ); // Пытаемся преобразовать символ в число
            СтрокаЦифр = СтрокаЦифр + Символ; // Если успешно — добавляем
        Исключение
            // Если возникла ошибка (символ не цифра), просто переходим к следующему
        Продолжить
        	// Переходим к следующему символу
        КонецПопытки;
    КонецЦикла;
    Возврат СтрокаЦифр; // Возвращаем строку с цифрами
КонецФункции

#КонецОбласти
