
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить только цифры из строки.
// 
// Параметры:
//  ВходнаяСтрока Входная строка из которой будут выбраны числа.
// 
// Возвращаемое значение:
//  Строка - Получить только цифры из строки
Функция ПолучитьТолькоЦифрыИзСтроки(ВходнаяСтрока) Экспорт
    СтрокаЦифр = ""; // Инициализируем пустую строку для результата
    ДлинаСтроки = СтрДлина(ВходнаяСтрока);
    Для НомерСимвола  = 1 ПО ДлинаСтроки Цикл
        Попытка
        	Символ = Сред(ВходнаяСтрока, НомерСимвола, 1);
            ЧислоИзСимвола = Число(Символ); // Пытаемся преобразовать символ в число
            СтрокаЦифр = СтрокаЦифр + Символ; // Если успешно — добавляем
        Исключение
            // Если возникла ошибка (символ не цифра), просто переходим к следующему
        Продолжить
        	// Переходим к следующему символу
        КонецПопытки;
    КонецЦикла;
    Возврат СтрокаЦифр; // Возвращаем строку с цифрами
КонецФункции

// Функция читает текст из файла docx на сервере
Функция ПрочитатьТекстИзDocx(ПутьКФайлу) Экспорт
	   
    ТекстДокумента = "";
    ПутьКоВременномуФайлу = ПолучитьИмяВременногоФайла("zip");
    КопироватьФайл(ПутьКФайлу, ПутьКоВременномуФайлу);
    
    Архив = Новый ЧтениеZipФайла(ПутьКоВременномуФайлу);
    ПутьРаспаковки = ПолучитьИмяВременногоФайла("");
    СоздатьКаталог(ПутьРаспаковки);
    
    // Извлекаем только основной контент
    ЭлементАрхива = Архив.Элементы.Найти("word/document.xml");
    Если ЭлементАрхива <> Неопределено Тогда
        Архив.Извлечь(ЭлементАрхива, ПутьРаспаковки);
    КонецЕсли;
    Архив.Закрыть();
    
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьРаспаковки + "/word/document.xml");
    
    Пока ЧтениеXML.Прочитать() Цикл
        // Текст в OpenXML хранится внутри тегов 
        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЛокальноеИмя = "t" Тогда
            ТекстДокумента = ТекстДокумента + ЧтениеXML.ПрочитатьСодержимое();
        КонецЕсли;
    КонецЦикла;
    
    ЧтениеXML.Закрыть();
    УдалитьФайлы(ПутьРаспаковки);
    УдалитьФайлы(ПутьКоВременномуФайлу);
    
    Возврат ТекстДокумента;

КонецФункции

#КонецОбласти
