
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить только цифры из строки.
// 
// Параметры:
//  ВходнаяСтрока Входная строка из которой будут выбраны числа.
// 
// Возвращаемое значение:
//  Строка - Получить только цифры из строки
Функция ПолучитьТолькоЦифрыИзСтроки(ВходнаяСтрока) Экспорт
    СтрокаЦифр = ""; // Инициализируем пустую строку для результата
    ДлинаСтроки = СтрДлина(ВходнаяСтрока);
    Для НомерСимвола  = 1 ПО ДлинаСтроки Цикл
        Попытка
        	Символ = Сред(ВходнаяСтрока, НомерСимвола, 1);
            ЧислоИзСимвола = Число(Символ); // Пытаемся преобразовать символ в число
            СтрокаЦифр = СтрокаЦифр + Символ; // Если успешно — добавляем
        Исключение
            // Если возникла ошибка (символ не цифра), просто переходим к следующему
        Продолжить
        	// Переходим к следующему символу
        КонецПопытки;
    КонецЦикла;
    Возврат СтрокаЦифр; // Возвращаем строку с цифрами
КонецФункции

// Функция читает текст из файла docx на сервере
Функция ПрочитатьТекстИзDocx(ПутьКФайлу) Экспорт
	   
    ТекстДокумента = "";
    ПутьКоВременномуФайлу = ПолучитьИмяВременногоФайла("zip");
    КопироватьФайл(ПутьКФайлу, ПутьКоВременномуФайлу);
    
    Архив = Новый ЧтениеZipФайла(ПутьКоВременномуФайлу);
    ПутьРаспаковки = ПолучитьИмяВременногоФайла("");
    СоздатьКаталог(ПутьРаспаковки);
    
    // Извлекаем только основной контент
    ЭлементАрхива = Архив.Элементы.Найти("word/document.xml");
    Если ЭлементАрхива <> Неопределено Тогда
        Архив.Извлечь(ЭлементАрхива, ПутьРаспаковки);
    КонецЕсли;
    Архив.Закрыть();
    
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьРаспаковки + "/word/document.xml");
    
    Пока ЧтениеXML.Прочитать() Цикл
        // Текст в OpenXML хранится внутри тегов 
        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЛокальноеИмя = "t" Тогда
            ТекстДокумента = ТекстДокумента + ЧтениеXML.ПрочитатьСодержимое();
        КонецЕсли;
    КонецЦикла;
    
    ЧтениеXML.Закрыть();
    УдалитьФайлы(ПутьРаспаковки);
    УдалитьФайлы(ПутьКоВременномуФайлу);
    
    Возврат ТекстДокумента;

КонецФункции

//Конвертирует в zip документ docx и читает файл comments.xml из разархивированной папки
//
// Параметры:
//  ДвоичныеДанныеФайла	 - Двоичные данные - Двоичные данные файла Word, который необходимо прочитать
// 
// Возвращаемое значение:
// Строка - Все примечания, которые есть в документе строкой 
//
Функция ИнициализироватьXMLИзDocx(ДвоичныеДанныеФайла) Экспорт
	
	ПутьКФайлу = ПолучитьИмяВременногоФайла("docx");
	ДвоичныеДанныеФайла.Записать(ПутьКФайлу);
	
	КопироватьФайл(ПутьКФайлу, СтрЗаменить(ПутьКФайлу, "docx", "zip"));
	ИмяФайлаСПутемZIP = СтрЗаменить(ПутьКФайлу, "docx", "zip");
	
	ВременнаяПапкаДляРазархивирования = ПолучитьИмяВременногоФайла("");
	
	Архив = Новый ЧтениеZipФайла();
	Архив.Открыть(ИмяФайлаСПутемZIP);
	Архив.ИзвлечьВсе(ВременнаяПапкаДляРазархивирования, РежимВосстановленияПутейФайловZIP.Восстанавливать);
	Архив.Закрыть(); 
	
	//В этом отдельном файле хранятся примечания скопом
	Файл = Новый Файл(ВременнаяПапкаДляРазархивирования + "/word/comments.xml");
		
	СтрокаПримечания = "";	
	//Если Файл.Существует() Тогда		
		
		//СтрокаПримечания = XMLComments(ВременнаяПапкаДляРазархивирования + "/word/document.xml");
		ТекстФайла = XMLText(ВременнаяПапкаДляРазархивирования + "/word/document.xml");	
	//КонецЕсли;
			
	УдалитьФайлы(ВременнаяПапкаДляРазархивирования);
	УдалитьФайлы(ПутьКФайлу);
	УдалитьФайлы(ИмяФайлаСПутемZIP);
	
	Возврат СтрокаПримечания;
	
КонецФункции

//Ищет теги примечания и берет текстовое значение в указанном файле.Учитываются комментарии только начинающиеся со знака "#"
//
// Параметры:
//  ПутьКФайлуСтраницы	 - 	Строка  - Путь к xml файлу, который нужно прочитать
// 
// Возвращаемое значение:
// Строка  - прочитанные значения (текст примечаний через перенос строки)
//
Функция XMLComments(ПутьКФайлу)
	Файл = Новый ЧтениеXML;
	Файл.ОткрытьФайл(ПутьКФайлу);
	
	МассивПримечания = Новый Массив;
	
	НачалсяКомментарий = Ложь;
	Пока Файл.Прочитать() Цикл			
		Если Файл.ТипУзла = ТипУзлаXML.НачалоЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Истина;
			СтрокаПримечаний = "";
			Продолжить;
		КонецЕсли;
		
		Если НачалсяКомментарий И Файл.ТипУзла = ТипУзлаXML.Текст Тогда
			СтрокаПримечаний = СтрокаПримечаний + Файл.Значение;
		КонецЕсли;
		
		Если Файл.ТипУзла = ТипУзлаXML.КонецЭлемента И Файл.Имя="w:t" Тогда
			НачалсяКомментарий = Ложь;
			МассивПримечания.Добавить(СтрокаПримечаний);
		КонецЕсли;		
	КонецЦикла;
	
	Файл.Закрыть();
	
	Сообщить("Привет" + СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС));
			
	Возврат СтрСоединить(МассивПримечания, Символы.ПС + Символы.ПС);

КонецФункции

Функция XMLText(ПутьКФайлу)
	ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.ОткрытьФайл(ПутьКФайлу); // + "/word/document.xml");
    ТекстДокумента = "";
    Пока ЧтениеXML.Прочитать() Цикл
        // Текст в OpenXML хранится внутри тегов 
        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.ЛокальноеИмя = "t" Тогда
            ТекстДокумента = ТекстДокумента + ЧтениеXML.Значение;//.ПрочитатьСодержимое();
        КонецЕсли;
    КонецЦикла;
    Возврат ТекстДокумента;
КонецФункции
#КонецОбласти
