#Область ОбработчикиСобытий
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ",
		ПользовательИБ.УникальныйИдентификатор);	
	
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не найден текущий пользоатель в справочнике";
		Сообщение.Сообщить();
		
		//Сообщить ("Не найден текущий пользоатель в справочнике")
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
